{
  "date": "20250906",
  "data_type": "articles_clean",
  "saved_at": "2025-09-07T17:42:35.035911",
  "articles": [
    {
      "link": "https://seekingalpha.com/article/4820084-banc-of-california-the-preferred-stock-appears-attractive?source=feed_all_articles",
      "title": "Banc Of California: The Preferred Stock Appears Attractive (NYSE:BANC)",
      "clean_text": "gguy44/iStock via Getty Images Banc of California ( NYSE: BANC ) hasnâ\u0080\u0099t really moved much (it has moved but the net return of the share price was close to zero in the past three years) since my previous article was published. However, as I have been (or am Consider joining European Small-Cap Ideas to gain exclusive access to actionable research on appealing Europe-focused investment opportunities, and to the real-time chat function to discuss ideas with similar-minded investors! This article was written by The Investment Doctor is a financial writer, highlighting European small-caps with a 5-7 year investment horizon. He strongly believes a portfolio should consist of a mixture of dividend and growth stocks. Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "gguy44/iStock via Getty Images Banc of California ( NYSE: BANC ) hasnâ\u0080\u0099t really moved much (it has moved but the net return of the share price was close to zero in the past three years) since my previous article was published. However, as I have been (or am Consider joining European Small-Cap Ideas to gain exclusive access to actionable research on appealing Europe-focused investment opportunities, and to the real-time chat function to discuss ideas with similar-minded investors! This article was written by The Investment Doctor is a financial writer, highlighting European small-caps with a 5-7 year investment horizon. He strongly believes a portfolio should consist of a mixture of dividend and growth stocks.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820205-nio-can-benefit-from-shifting-market-dynamics?source=feed_all_articles",
      "title": "NIO Can Benefit From Shifting Market Dynamics (NYSE:NIO)",
      "clean_text": "Justin Paget/DigitalVision via Getty Images Chinese electric vehicle marker Nio Inc. ( NYSE: NIO ) has seen its stock gain more than 40% this year. I believe there is still strong upside ahead despite some near-term pressures. This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in NIO, over the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Justin Paget/DigitalVision via Getty Images Chinese electric vehicle marker Nio Inc. ( NYSE: NIO ) has seen its stock gain more than 40% this year. I believe there is still strong upside ahead despite some near-term pressures. This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, but may initiate a beneficial Long position through a purchase of the stock, or the purchase of call options or similar derivatives in NIO, over the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820192-adobe-kroger-to-report-earnings-while-markets-await-core-cpi?source=feed_all_articles",
      "title": "Adobe, Kroger To Report Earnings While Markets Await Core CPI",
      "clean_text": "Wall Street traded higher on Thursday, as investors weighed fresh jobs data for clues on the labor marketâ\u0080\u0099s strength. On a sector-by-sector basis, 10 of the 11 S&P segments finished trading in positive territory, led by Consumer Discretionary and Communication Services. At the other end of the spectrum, Utilities lagged the most on Thursday. On the more political side, President Donald Trump urged the Supreme Court to quickly accept and rule on an appeal aiming to overturn lower court rulings that deemed most of his tariffs illegal. Markets awaited Fridayâ\u0080\u0099s jobs report because, according to analysts, if the job market gets bad enough, the Fed may be forced to cut rates more aggressively, regardless of inflation. Investors will be keeping an eye out for minute economic indications ahead of the anticipated rate cut announcement. Some important economic reports due to be announced next week include Consumer Credit on Monday, Payrolls, and the EIA short-term energy outlook on Tuesday. Meanwhile, Wednesday will include reports on PPI, Core PPI, and Wholesale Inventories. Jobless Claims, CPI, and Core CPI will be released on Thursday, and reports on Inflation Expectations and Consumer Sentiment will be out on Friday. Adobe ( ADBE ), Kroger ( KR ), Chewy ( CHWY ), Daktronics ( DAKT ), Vince ( VNCE ), Synopsys ( SNPS ), Rubrik ( RBRK ) and GameStop ( GME ) will report earnings next week. _____________________________________________________________________ Earnings spotlight: Monday, September 8: Casey's ( CASY ), Planet Labs ( PL ). See the full earnings calendar . Earnings spotlight: Tuesday, September 9: Synopsys, Rubrik, GameStop. See the full earnings calendar . Earnings spotlight: Wednesday, September 10: Chewy, Daktronics, Vince. See This article was written by",
      "excerpt": "Wall Street traded higher on Thursday, as investors weighed fresh jobs data for clues on the labor marketâ\u0080\u0099s strength. On a sector-by-sector basis, 10 of the 11 S&P segments finished trading in positive territory, led by Consumer Discretionary and Communication Services. At the other end of the spectrum, Utilities lagged the most on Thursday. On the more political side, President Donald Trump urged the Supreme Court to quickly accept and rule on an appeal aiming to overturn lower court rulings that deemed most of his tariffs illegal. Markets awaited Fridayâ\u0080\u0099s jobs report because, according to analysts, if the job market gets bad enough, the Fed may be forced to cut rates more aggressively, regardless of inflation. Investors will be keeping an eye out for minute economic indications ahead of the anticipated rate cut announcement.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820204-ultra-bullish-on-unemployment-ticking-up-to-4-3-percent-in-august?source=feed_all_articles",
      "title": "Ultra Bullish On Unemployment Ticking Up To 4.3% In August (SP500)",
      "clean_text": "Duncan Nicholls and Simon Webb/OJO Images via Getty Images The S&P 500 hit a new all-time high last Friday, as market participants were digesting the BLS Employment Situation print. The results looked very bullish to me, especially the (expected) increase in unemployment. That said, for many, the latest nonfarm payrolls figures were quite uninspiring, to say This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of SLDP, RCAT, CRWV, NVTS, AMPX, NBIS, SOXL, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Duncan Nicholls and Simon Webb/OJO Images via Getty Images The S&P 500 hit a new all-time high last Friday, as market participants were digesting the BLS Employment Situation print. The results looked very bullish to me, especially the (expected) increase in unemployment. That said, for many, the latest nonfarm payrolls figures were quite uninspiring, to say This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of SLDP, RCAT, CRWV, NVTS, AMPX, NBIS, SOXL, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820078-ionq-buying-quantum-growth-at-a-cost?source=feed_all_articles",
      "title": "IonQ: Buying Quantum Growth At A Cost (NYSE:IONQ)",
      "clean_text": "blackdovfx/iStock via Getty Images Over the last few months, IonQ, Inc. ( NYSE: IONQ ) has made numerous acquisitions to boost growth. The quantum computing company has stated a goal of becoming the \"Nvidia of quantum computing,\" likely leading to the market overlooking If you'd like to learn more about how to best position yourself in under valued stocksÂ mispriced by the market to start September, consider joining Out Fox The Street .Â This article was written by Stone Fox Capital is an RIA from Oklahoma. Mark Holder is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 15 years as a portfolio manager. Mark leads the investing group Out Fox The Street where he shares stock picks and deep research to help readers uncover potential multibaggers while managing portfolio risk via diversification. Features include various model portfolios, stock picks with identifiable catalysts, daily updates, real-time alerts, and access to community chat and direct chat with Mark for questions. Learn more Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. The information contained herein is for informational purposes only. Nothing in this article should be taken as a solicitation to purchase or sell securities. Before buying or selling any stock, you should do your own research and reach your own conclusion or consult a financial advisor. Investing includes risks, including loss of principal. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "blackdovfx/iStock via Getty Images Over the last few months, IonQ, Inc. ( NYSE: IONQ ) has made numerous acquisitions to boost growth. The quantum computing company has stated a goal of becoming the \"Nvidia of quantum computing,\" likely leading to the market overlooking If you'd like to learn more about how to best position yourself in under valued stocksÂ mispriced by the market to start September, consider joining Out Fox The Street .Â This article was written by Stone Fox Capital is an RIA from Oklahoma. Mark Holder is a CPA with degrees in Accounting and Finance. He is also Series 65 licensed and has 30 years of investing experience, including 15 years as a portfolio manager. Mark leads the investing group Out Fox The Street where he shares stock picks and deep research to help readers uncover potential multibaggers while managing portfolio risk via diversification.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820195-august-jobs-report-catalyst-for-50-bps-rate-cut?source=feed_all_articles",
      "title": "August Jobs Report: Catalyst For A 50bps Rate Cut? (NDX)",
      "clean_text": "Luis Alvarez/DigitalVision via Getty Images The fine print of Fed Chair Powell's recent speech at the annual Jackson Hole Economic Policy Symposium might have raised some questions on whether a policy rate cut is indeed in the offing at This article was written by Manika is a macroeconomist with over 20 years of experience in industries including investment management, stock broking, investment banking. She also runs the profile Long Term Tips [LTT], which focuses on the generational opportunity in the green economy. Her investing group, Green Growth Giants , takes the theme a step further from LTT with a deeper dive into opportunities presented by the segment. Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Luis Alvarez/DigitalVision via Getty Images The fine print of Fed Chair Powell's recent speech at the annual Jackson Hole Economic Policy Symposium might have raised some questions on whether a policy rate cut is indeed in the offing at This article was written by Manika is a macroeconomist with over 20 years of experience in industries including investment management, stock broking, investment banking. She also runs the profile Long Term Tips [LTT], which focuses on the generational opportunity in the green economy. Her investing group, Green Growth Giants , takes the theme a step further from LTT with a deeper dive into opportunities presented by the segment. Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.bbc.com/news/articles/c39rk4jlpw7o?at_medium=RSS&at_campaign=rss",
      "title": "Starmer resets after Rayner row, but Labour turmoil is a gift for Reform",
      "clean_text": "Welcome to the weird world of UK politics 2025. The TV presenter Jeremy Kyle announces to a huge crowd of Nigel Farage supporters at Reform UK's party conference that David Lammy is the new number two in government and they boo, panto-style. And there's a YouTube video of the (now former) deputy prime minister dancing in a tracksuit and chunky gold chain waving wads of cash that's been watched more than 1.5m times. These might both sound like parodies, but only the video of Angela Rayner rapping \"How Many Homes Can Rayner Buy\" was a joke. And what was planned as No 10's \"get back in charge week\" has been blown up by a row you couldn't make up – the housing secretary in trouble for not paying tens of thousands of pounds of tax on her expensive new house. Her exit pushed the button on a chunky shakeup of Sir Keir Starmer's team. The start of this political season has been wild. In the end, Rayner's decision to go was clear cut. The official report into her behaviour said she'd tried to do the right thing, but not tried hard enough. So the rules had been broken. Her camp reckoned she had no option. No 10 agreed. There is frustration that the manner of her exit from government gave her critics what they wanted. But she knew she had no choice, and was devastated by her own mistake. It's acutely and specifically painful for Labour because Rayner had personally styled herself as something of a sleaze-buster. It was she who often led the charge against the succession of Conservatives who got into trouble over their own complicated financial arrangements, hurling accusations of arrogance and greed on a fairly regular basis. She was the shoutier end of Starmer's so called \"Mr Rules\" approach, a serious belief that government had to be washed clean of its tawdry image after multiple scandals and Boris Johnson's, ahem , flexible attitude to the normal rules. She portrayed herself as a loud and proud champion of ordinary people looking at the worst Westminster behaviour in disgust. For Labour in general, it undermines again, their claim to be different to those who went before, to return government to the \"service of the people\", as Sir Keir said so many times – to be competent, with clean heels. For the government's number two to have messed up her tax affairs undermines faith in ministers' ability. As one MP put it, \"it's not even a rookie error, it's 40,000 smackers of oversight\". And for such a prominent politician to lose their job over property dealings that many of the public couldn't imagine being able to afford gives the impression, again, that politicians live in a different world. \"There's just the smell test,\" a Labour insider said. This time last year, Rayner, the prime minister himself, and even the chancellor were all red faced for taking, albeit permitted freebies, of clothes, glasses, and gig tickets, struggling to explain why politicians are entitled to free stuff the rest of us are not. Twelve months on, Rayner is the fifth minister who has quit after their actions caused embarrassment for the government. Those clean heels look a bit scruffy now. The mess is, of course, a gift for Nigel Farage. At his party's conference in Birmingham on Friday Rayner's exit didn't just shove him on stage a few hours early for his speech to try to grab a space in the news cycle, it gave more ammunition to his fundamental argument. Reform's pitch rests on a claim that the two big parties are as bad as each other, and preside over a system that is bust. Does his vow he could stop the small boats in a fortnight stand up? We've been speaking to the Reform leader, and our full interview will be on the show on Sunday. The prime minister's answer to the drama of the last couple of days? Making changes to his ministers. The decisions were made finally because of Rayner's exit but the moves have been long in the making. Downing Street's hope is to salvage opportunity out of what was fast morphing into a crisis. A No 10 source tells me: \"None of",
      "excerpt": "Welcome to the weird world of UK politics 2025. The TV presenter Jeremy Kyle announces to a huge crowd of Nigel Farage supporters at Reform UK's party conference that David Lammy is the new number two in government and they boo, panto-style. And there's a YouTube video of the (now former) deputy prime minister dancing in a tracksuit and chunky gold chain waving wads of cash that's been watched more than 1.5m times. These might both sound like parodies, but only the video of Angela Rayner rapping \"How Many Homes Can Rayner Buy\" was a joke. And what was planned as No 10's \"get back in charge week\" has been blown up by a row you couldn't make up – the housing secretary in trouble for not paying tens of thousands of pounds of tax on her expensive new house. Her exit pushed the button on a chunky shakeup of Sir Keir Starmer's team. The start of this political season has been wild.",
      "source": "feeds.bbci"
    },
    {
      "link": "https://seekingalpha.com/article/4819099-5-relatively-secure-and-cheap-dividend-stocks-yields-9-percent-sept-2025?source=feed_all_articles",
      "title": "5 Relatively Secure And Cheap Dividend Stocks, Yields Upto 9% (Sept. 2025)",
      "clean_text": "Olivier Le Moal/iStock via Getty Images ************ Author's Note: This is our monthly series on Dividend Stocks, usually published in the first week of every month. We scan the universe of roughly 7,500 stocks listed and traded on U.S. exchanges and use our High Income DIY Portfolios: The primary goal of \"High Income DIY Portfolios\" Marketplace service is high income with low risk and preservation of capital. It provides DIY investors with vital information and portfolio/asset allocation strategies to help create stable, long-term passive income with sustainable yields. The portfolios are designed for Income-Investors (including retirees or near-retirees). We provide seven portfolios: 3 buy-and-hold, 3 Rotational portfolios, and 3-Bucket NPP Model Portfolio. This includes two High-Income portfolios, two DGI portfolios, and a conservative NPP strategy portfolio with low drawdowns and high growth. For more details or a two-week free trial, please click here . This article was written by Financially Free Investor is a financial writer with 25 years investment experience. He focuses on investing in dividend-growing stocks with a long-term horizon. He applies a unique 3-basket investment approach that aims for 30% lower drawdowns, 6% current income, and market-beating growth on a long-term basis and he focuses on dividend-growing stocks with a long-term horizon. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of ABT, ABBV, CI, JNJ, PFE, NVS, NVO, AZN, UNH, CL, CLX, UL, NSRGY, PG, TSN, ADM, BTI, MO, PM, KO, PEP, EXC, D, DEA, DEO, ENB, MCD, BAC, PRU, UPS, WMT, WBA, CVS, LOW, AAPL, IBM, CSCO, MSFT, INTC, T, VZ, CVX, XOM, VLO, ABB, ITW, MMM, LMT, LYB, RIO, O, NNN, WPC, ARCC, ARDC, AWF, CII, CHI, DNP, PEO, USA, UTF, UTG, TLT either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Disclaimer: The information presented in this article is for informational purposes only and in no way should be construed as financial advice or recommendation to buy or sell any stock. The author is not a financial advisor. Please always do further research and do your own due diligence before making any investments. Every effort has been made to present the data/information accurately; however, the author does not claim 100% accuracy. The stock portfolios presented here are model portfolios for demonstration purposes. For the complete list of our LONG positions, please see our profile on Seeking Alpha. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Olivier Le Moal/iStock via Getty Images ************ Author's Note: This is our monthly series on Dividend Stocks, usually published in the first week of every month. We scan the universe of roughly 7,500 stocks listed and traded on U.S. exchanges and use our High Income DIY Portfolios: The primary goal of \"High Income DIY Portfolios\" Marketplace service is high income with low risk and preservation of capital. It provides DIY investors with vital information and portfolio/asset allocation strategies to help create stable, long-term passive income with sustainable yields. The portfolios are designed for Income-Investors (including retirees or near-retirees). We provide seven portfolios: 3 buy-and-hold, 3 Rotational portfolios, and 3-Bucket NPP Model Portfolio.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820073-buckle-up-for-the-biggest-market-disruption-since-the-industrial-revolution?source=feed_all_articles",
      "title": "Buckle Up For The Biggest Market Disruption Since The Industrial Revolution",
      "clean_text": "Thomas B Lee/iStock via Getty Images Earlier this week, I participated in the introductory lecture for the Purchasing Management course at my alma mater in the Netherlands. It's been about six years since I took that course, which was part of Test Drive iREITÂ© on Alpha For FREE (for 2 Weeks) Join iREIT on Alpha today to get the most in-depth research that includes REITs, mREITs, Preferreds, BDCs, MLPs, ETFs, and other income alternatives. 438 testimonials and most are 5 stars. Nothing to lose with our FREE 2-week trial . And this offer includes a 2-Week FREE TRIAL plus Brad Thomas' FREE book . This article was written by Leo Nelissen is an analyst focusing on major economic developments related to supply chains, infrastructure, and commodities. He is a contributing author for iREITÂ®+HOYA Capital . As a member of the iREITÂ®+HOYA Capital team, Leo aims to provide insightful analysis and actionable investment ideas, with a particular emphasis on dividend growth opportunities. Learn More . Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Thomas B Lee/iStock via Getty Images Earlier this week, I participated in the introductory lecture for the Purchasing Management course at my alma mater in the Netherlands. It's been about six years since I took that course, which was part of Test Drive iREITÂ© on Alpha For FREE (for 2 Weeks) Join iREIT on Alpha today to get the most in-depth research that includes REITs, mREITs, Preferreds, BDCs, MLPs, ETFs, and other income alternatives. 438 testimonials and most are 5 stars. Nothing to lose with our FREE 2-week trial . And this offer includes a 2-Week FREE TRIAL plus Brad Thomas' FREE book . This article was written by Leo Nelissen is an analyst focusing on major economic developments related to supply chains, infrastructure, and commodities. He is a contributing author for iREITÂ®+HOYA Capital .",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4820190-ollies-bargain-outlet-holdings-long-term-growth-story-remains-intact?source=feed_all_articles",
      "title": "Ollie's Bargain Outlet Holdings: Long-Term Growth Story Remains Intact (NASDAQ:OLLI)",
      "clean_text": "MoMo Productions/DigitalVision via Getty Images I had a buy rating for Ollieâ\u0080\u0099s Bargain Outlet Holdings ( NASDAQ: OLLI ) previously, as I continue to see a clear growth story playing out, with solid execution and healthy underlying demand. After reviewing the This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "MoMo Productions/DigitalVision via Getty Images I had a buy rating for Ollieâ\u0080\u0099s Bargain Outlet Holdings ( NASDAQ: OLLI ) previously, as I continue to see a clear growth story playing out, with solid execution and healthy underlying demand. After reviewing the This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/ispecimen-receives-crypto-treasury-proposals-amid-200m-digital-plan-432SI-4225310",
      "title": "iSpecimen receives crypto treasury proposals amid $200M digital plan By Investing.com",
      "clean_text": "iSpecimen Inc. (ISPC) announced it has been approached by several cryptocurrency companies presenting investment opportunities as the biospecimen sourcing company pursues plans to build a $200 million digital asset treasury. The Woburn, Massachusetts-based company said the approaches include opportunities in tokenized real-world assets and highly ranked cryptocurrencies. iSpecimen continues parallel discussions to develop a Solana blockchain-based treasury program, according to a company statement. \"We are refining our approach to build a digital asset treasury. While the acquisition of Locked Solana appeals, we recognize there are many opportunities that we continue to explore,\" said Robert Lim, chief executive officer. The company plans to establish a SOL-based treasury program using the native token of the Solana network to diversify its balance sheet and support growth initiatives. iSpecimen intends to source treasury management expertise for policy design, counterparty diligence, execution, custody coordination, risk management and reporting. The treasury program contemplates purchasing SOL through over-the-counter transactions with cryptocurrency institutions, including Locked SOL that carries contractual transfer or vesting restrictions. Locked SOL typically trades at a discount to spot prices due to illiquidity and lock-up risk. iSpecimen plans to fund the treasury program primarily from capital raised periodically. The company said it will employ a buy-and-hold strategy and purchase locked SOL at discounts. Plans include staking the Solana holdings to generate yields while maintaining a small percentage for spot trading. iSpecimen operates an online marketplace connecting scientists with healthcare providers for human biospecimens used in medical research.",
      "excerpt": "iSpecimen Inc. (ISPC) announced it has been approached by several cryptocurrency companies presenting investment opportunities as the biospecimen sourcing company pursues plans to build a $200 million digital asset treasury. The Woburn, Massachusetts-based company said the approaches include opportunities in tokenized real-world assets and highly ranked cryptocurrencies. iSpecimen continues parallel discussions to develop a Solana blockchain-based treasury program, according to a company statement. \"We are refining our approach to build a digital asset treasury. While the acquisition of Locked Solana appeals, we recognize there are many opportunities that we continue to explore,\" said Robert Lim, chief executive officer. The company plans to establish a SOL-based treasury program using the native token of the Solana network to diversify its balance sheet and support growth initiatives.",
      "source": "Investing.com"
    },
    {
      "link": "https://seekingalpha.com/article/4820194-sentinelone-dont-lay-blame-on-the-market-downgrade?source=feed_all_articles",
      "title": "SentinelOne: Don't Lay Blame On The Market (Downgrade) (NYSE:S)",
      "clean_text": "Sundry Photography/iStock Editorial via Getty Images Is the market really wrong? I often hear this lament from investors where the market went against their narrative (but didn't think it should). Yet, I think it's also critical for This article was written by JR Research is an opportunistic investor. He was recognized by TipRanks as a Top Analyst. He was also recognized by Seeking Alpha as a \"Top Analyst To Follow\" for Technology, Software, and Internet, as well as for Growth and GARP. He identifies attractive risk/reward opportunities supported by robust price action to potentially generate alpha well above the S&P 500. He has also demonstrated outperformance with his picks. He focuses on identifying growth investing opportunities that present the most attractive risk/reward upside potential. His approach combines sharp price action analysis with fundamentals investing. He tends to avoid overhyped and overvalued stocks while capitalizing on battered stocks with significant upside recovery possibilities. He runs the investing group Ultimate Growth Investing which specializes in identifying high-potential opportunities across various sectors. He focuses on ideas that has strong growth potential and well-beaten contrarian plays, with an 18 to 24 month outlook for the thesis to play out. The group is designed for investors seeking to capitalize on growth stocks with robust fundamentals, buying momentum, and turnaround plays at highly attractive valuations. Learn more Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of XLK, IGV, QQQ either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Sundry Photography/iStock Editorial via Getty Images Is the market really wrong? I often hear this lament from investors where the market went against their narrative (but didn't think it should). Yet, I think it's also critical for This article was written by JR Research is an opportunistic investor. He was recognized by TipRanks as a Top Analyst. He was also recognized by Seeking Alpha as a \"Top Analyst To Follow\" for Technology, Software, and Internet, as well as for Growth and GARP. He identifies attractive risk/reward opportunities supported by robust price action to potentially generate alpha well above the S&P 500. He has also demonstrated outperformance with his picks. He focuses on identifying growth investing opportunities that present the most attractive risk/reward upside potential. His approach combines sharp price action analysis with fundamentals investing.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819748-portfolio-review-3-stocks-and-3-etfs-buying-to-boost-passive-income?source=feed_all_articles",
      "title": "Portfolio Review: 3 Stocks And 3 ETFs I'm Buying To Boost My Passive Income",
      "clean_text": "imagedepotpro/iStock via Getty Images Just checked. The future is still uncertain. In fact, it feels more uncertain than ever. Some folks, like Tom Lee, think we are in the early stages of a new bull market. Others, like Moody's chief economist Mark Zandi If you want access to our entire Portfolio and all our current Top Picks, feel free to join us for a 2-week free trial at High Yield Landlord. We are the largest real estate investment community on Seeking Alpha with over 2,000 members on board and a perfect 5/5 rating from 400+ reviews: For a Limited Time - You can join us at a deeply reduced rate! Start Your 2-Week Free Trial Today! This article was written by Austin Rogers is a REIT specialist with a professional background in commercial real estate. He writes about high-quality dividend growth stocks with the goal of generating the safest growing passive income stream possible. Since his ideal holding period is \"lifelong,\" his focus is on portfolio income growth rather than total returns. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of SCHD, HDV, MLPX, DGRO, JEPI, CDL, TBG, PFFA, ADC, AMT, IRM, CGDG, XLU either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "imagedepotpro/iStock via Getty Images Just checked. The future is still uncertain. In fact, it feels more uncertain than ever. Some folks, like Tom Lee, think we are in the early stages of a new bull market. Others, like Moody's chief economist Mark Zandi If you want access to our entire Portfolio and all our current Top Picks, feel free to join us for a 2-week free trial at High Yield Landlord. We are the largest real estate investment community on Seeking Alpha with over 2,000 members on board and a perfect 5/5 rating from 400+ reviews: For a Limited Time - You can join us at a deeply reduced rate! Start Your 2-Week Free Trial Today! This article was written by Austin Rogers is a REIT specialist with a professional background in commercial real estate. He writes about high-quality dividend growth stocks with the goal of generating the safest growing passive income stream possible.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/nowpayments-to-participate-in-sigma-europe-rome-2025-4224736",
      "title": "NOWPayments to Participate in SiGMA Europe Rome 2025 By Chainwire",
      "clean_text": "AMSTERDAM, NETHERLANDS, September 3rd, 2025, Chainwire SiGMA has officially shortlisted NOWPayments in the “Best Crypto Processing” category at the SiGMA Euro-Med Awards 2025 . This acknowledgment places NOWPayments among the notable solutions in the crypto payments industry. In addition, Forbes ranked NOWPayments #1 in its “5 Best Cryptocurrency Gateways of 2025” list — further validating the company’s growing impact on the digital payments landscape. Participation in SiGMA Europe Rome 2025 NOWPayments has also confirmed its participation in SiGMA Europe Rome 2025 , scheduled for November. The conference is one of the largest gatherings for blockchain, fintech, and iGaming, offering a global stage for companies shaping the future of digital finance. Solutions for iGaming Businesses NOWPayments provides tailored crypto payment solutions for the iGaming sector. With support for 300+ cryptocurrencies , instant settlements, automated payouts, and compliance features, the gateway offers operators: (Source: SiGMA Shortlist, Forbes) About NOWPayments NOWPayments , founded in 2019 , is a cryptocurrency payment gateway offering both custodial and non-custodial solutions. Its mission is to make digital assets accessible for businesses and individuals worldwide by delivering secure, seamless, and flexible payment tools. Supporting more than 300 cryptocurrencies and prioritizing compliance, NOWPayments empowers industries — from e-commerce to iGaming — to adopt crypto with confidence. Alex Y NOWPayments alexandr.y@nowpayments.io This article was originally published on Chainwire",
      "excerpt": "AMSTERDAM, NETHERLANDS, September 3rd, 2025, Chainwire SiGMA has officially shortlisted NOWPayments in the “Best Crypto Processing” category at the SiGMA Euro-Med Awards 2025 . This acknowledgment places NOWPayments among the notable solutions in the crypto payments industry. In addition, Forbes ranked NOWPayments #1 in its “5 Best Cryptocurrency Gateways of 2025” list — further validating the company’s growing impact on the digital payments landscape. Participation in SiGMA Europe Rome 2025 NOWPayments has also confirmed its participation in SiGMA Europe Rome 2025 , scheduled for November. The conference is one of the largest gatherings for blockchain, fintech, and iGaming, offering a global stage for companies shaping the future of digital finance. Solutions for iGaming Businesses NOWPayments provides tailored crypto payment solutions for the iGaming sector.",
      "source": "Investing.com"
    }
  ],
  "total_articles": 14,
  "cleaned_at": "2025-09-07T17:42:35.035891"
}