{
  "date": "20250903",
  "data_type": "articles_clean",
  "saved_at": "2025-09-07T16:41:27.166390",
  "articles": [
    {
      "link": "https://seekingalpha.com/article/4819041-the-campbells-company-2025-q4-results-earnings-call-presentation?source=feed_all_articles",
      "title": "The Campbell's Company 2025 Q4 - Results - Earnings Call Presentation (NASDAQ:CPB)",
      "clean_text": "The following slide deck was published by The Campbell's Company in conjunction with their 2025 Q4 earnings call. This article was written by",
      "excerpt": "The following slide deck was published by The Campbell's Company in conjunction with their 2025 Q4 earnings call. This article was written by",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818970-tractor-supply-company-tsco-presents-at-goldman-sachs-32nd-annual-global-retailing-conference?source=feed_all_articles",
      "title": "Tractor Supply Company (TSCO) Presents at Goldman Sachs 32nd Annual Global Retailing",
      "clean_text": "Tractor Supply Company ( NASDAQ: TSCO ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 3, 2025 9:35 AM EDT Company Participants Harry Lawton - President, CEO & Director Kurt Barton - Executive VP, CFO & Treasurer Conference Call Participants Katharine McShane - Goldman Sachs Group, Inc., Research Division Presentation Katharine McShane MD & Retail Analyst Okay. Good morning. Thank you for joining us. It's our pleasure to introduce Tractor Supply Company. Today, we have with us Hal Lawton, President and Chief Executive Officer of Tractor Supply. Hal has served as President and CEO since January 2020. We have with us too, Kurt Barton, Executive Vice President and Chief Financial Officer and Treasurer of Tractor Supply. Kurt has been in the role since February 2019. And we'll start there, and thanks for joining us, both of you, today. Thank you. Harry Lawton President, CEO & Director Yes, thanks for having us, Kate. Question-and-Answer Session Katharine McShane Goldman Sachs Group, Inc., Research Division I think if we can just start maybe talking about the health of the consumer, you guys see a really broad swath of the consumer. And so we'd love to hear your view on what you're seeing and hearing and what you expect for the second half this year. Harry Lawton President, CEO & Director Yes. From our view, the consumer is healthy and resilient, remarkably resilient. You think about the challenges the consumer has been through over the last 5, 6 years, and they've just been remarkably resilient through it. They've evolved, iterated, adjusted based on the conditions, but GDP continues to be strong. Consumer spending continues to be strong. And that's what we see in our business. We saw a nice sequential improvement through the second quarter, last quarter. Talked about how the third quarter was off to a good start. We",
      "excerpt": "Tractor Supply Company ( NASDAQ: TSCO ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 3, 2025 9:35 AM EDT Company Participants Harry Lawton - President, CEO & Director Kurt Barton - Executive VP, CFO & Treasurer Conference Call Participants Katharine McShane - Goldman Sachs Group, Inc., Research Division Presentation Katharine McShane MD & Retail Analyst Okay. Good morning. Thank you for joining us. It's our pleasure to introduce Tractor Supply Company. Today, we have with us Hal Lawton, President and Chief Executive Officer of Tractor Supply. Hal has served as President and CEO since January 2020. We have with us too, Kurt Barton, Executive Vice President and Chief Financial Officer and Treasurer of Tractor Supply. Kurt has been in the role since February 2019. And we'll start there, and thanks for joining us, both of you, today. Thank you.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818977-norwood-financial-looks-to-rebound-after-rocky-end-to-2024?source=feed_all_articles",
      "title": "Norwood Financial Looks To Rebound After Rocky End To 2024 (NASDAQ:NWFL)",
      "clean_text": "Getty Images The life of a small community bank is often one of frequent acquisitions. In the typical financial circle of life, these banks absorb others to expand their operations until they, themselves, are bought out by a larger competitor. One of the most This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Getty Images The life of a small community bank is often one of frequent acquisitions. In the typical financial circle of life, these banks absorb others to expand their operations until they, themselves, are bought out by a larger competitor. One of the most This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818975-icln-renewable-energy-set-for-growth-before-tax-credits-expire?source=feed_all_articles",
      "title": "ICLN: Renewable Energy Set For Growth Before Tax Credits Expire (NASDAQ:ICLN)",
      "clean_text": "xijian/E+ via Getty Images The iShares Global Clean Energy ETF ( NASDAQ: ICLN ) is an exchange-traded fund designed to provide investors with exposure to producers of clean energy. With energy policies phasing out tax credits for renewable energy sources, I believe clean energy may have one last This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of GEV either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "xijian/E+ via Getty Images The iShares Global Clean Energy ETF ( NASDAQ: ICLN ) is an exchange-traded fund designed to provide investors with exposure to producers of clean energy. With energy policies phasing out tax credits for renewable energy sources, I believe clean energy may have one last This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of GEV either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818910-dollar-tree-inc-dltr-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "title": "Dollar Tree, Inc. (DLTR) Q2 2025 Earnings Call Transcript",
      "clean_text": "Dollar Tree, Inc. ( NASDAQ: DLTR ) Q2 2025 Earnings Call September 3, 2025 8:00 AM EDT Company Participants Robert LaFleur - Senior Vice President of Investor Relations Michael Creedon - CEO & Director Stewart Glendinning - Chief Financial Officer Conference Call Participants Michael Lasser - UBS Investment Bank, Research Division Paul Lejuez - Citigroup Inc., Research Division Edward Kelly - Wells Fargo Securities, LLC, Research Division Uriel Zachary Abraham - Morgan Stanley, Research Division Matthew Boss - JPMorgan Chase & Co, Research Division Charles Grom - Gordon Haskett Research Advisors Rupesh Parikh - Oppenheimer & Co. Inc., Research Division John Heinbockel - Guggenheim Securities, LLC, Research Division Seth Sigman - Barclays Bank PLC, Research Division Scot Ciccarelli - Truist Securities, Inc., Research Division Zhihan Ma - Sanford C. Bernstein & Co., LLC., Research Division Peter Keith - Piper Sandler & Co., Research Division Kelly Bania - BMO Capital Markets Equity Research Michael Montani - Evercore ISI Institutional Equities, Research Division Presentation Operator Greetings, and welcome to the Dollar Tree Q2 2025 Earnings Call. [Operator Instructions] As a reminder, this conference is being recorded. It's now my pleasure to turn the call over to Bob LaFleur, Senior Vice President, Investor Relations. Bob, please go ahead. Robert LaFleur Senior Vice President of Investor Relations Good morning, and thank you for joining us today to discuss Dollar Tree's Second Quarter fiscal 2025 results. With me today are Dollar Tree's CEO, Mike Creedon and CFO, Stewart Glendinning. Before we begin, I would like to remind everyone that some of the remarks that we will make today about the company's expectations, plans and future prospects are considered forward-looking statements under the safe harbor provision of the Private Securities Litigation Reform Act of 1995. These statements are subject to risks and uncertainties, which could cause actual results to differ materially from those contemplated by our forward-looking statements. For information on the risks and",
      "excerpt": "Dollar Tree, Inc. ( NASDAQ: DLTR ) Q2 2025 Earnings Call September 3, 2025 8:00 AM EDT Company Participants Robert LaFleur - Senior Vice President of Investor Relations Michael Creedon - CEO & Director Stewart Glendinning - Chief Financial Officer Conference Call Participants Michael Lasser - UBS Investment Bank, Research Division Paul Lejuez - Citigroup Inc., Research Division Edward Kelly - Wells Fargo Securities, LLC, Research Division Uriel Zachary Abraham - Morgan Stanley, Research Division Matthew Boss - JPMorgan Chase & Co, Research Division Charles Grom - Gordon Haskett Research Advisors Rupesh Parikh - Oppenheimer & Co. Inc., Research Division John Heinbockel - Guggenheim Securities, LLC, Research Division Seth Sigman - Barclays Bank PLC, Research Division Scot Ciccarelli - Truist Securities, Inc., Research Division Zhihan Ma - Sanford C. Bernstein & Co., LLC.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818960-august-aaii-asset-allocation-survey-stock-allocations-decrease?source=feed_all_articles",
      "title": "August AAII Asset Allocation Survey: Stock Allocations Decrease",
      "clean_text": "DNY59/E+ via Getty Images Individual investorsâ\u0080\u0099 allocations to stocks decreased while bond and cash allocations increased in the August AAII Asset Allocation Survey. Stock and stock fund allocations decreased 1.0 percentage points to 67.3%. Stock and stock fund allocations are This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "DNY59/E+ via Getty Images Individual investorsâ\u0080\u0099 allocations to stocks decreased while bond and cash allocations increased in the August AAII Asset Allocation Survey. Stock and stock fund allocations decreased 1.0 percentage points to 67.3%. Stock and stock fund allocations are This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it. I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818915-macys-inc-m-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "title": "Macy's, Inc. (M) Q2 2025 Earnings Call Transcript",
      "clean_text": "Macy's, Inc. ( NYSE: M ) Q2 2025 Earnings Call September 3, 2025 8:00 AM EDT Company Participants Pamela Quintiliano - Head of Investor Relations Antony Spring - CEO & Chairman Thomas Edwards - COO & CFO Conference Call Participants Matthew Boss - JPMorgan Chase & Co, Research Division Dana Telsey - Telsey Advisory Group LLC Blake Anderson - Jefferies LLC, Research Division Oliver Chen - TD Cowen, Research Division Alexandra Straton - Morgan Stanley, Research Division Tracy Kogan - Citigroup Inc., Research Division Michael Binetti - Evercore ISI Institutional Equities, Research Division Paul Kearney - Barclays Bank PLC, Research Division Jay Sole - UBS Investment Bank, Research Division Janet Kloppenburg - JJK Research Associates, Inc. Presentation Operator Greetings, and welcome to the Macy's, Inc. Second Quarter 2025 Earnings Call. [Operator Instructions] As a reminder, this conference is being recorded. I would now like to turn the call over to Pamela Quintiliano, VP of Investor Relations. Pamela, you may now begin. Pamela Quintiliano Head of Investor Relations Thank you, operator. Good morning, everyone, and thanks for joining us. With me on the call today are Tony Spring, our Chairman and CEO; and Tom Edwards, our COO and CFO. Along with our second quarter 2025 press release, a Form 8-K has been filed with the Securities and Exchange Commission, and the presentation has been posted on the Investors section of our website, macysinc.com and is being displayed live during today's webcast. Unless otherwise noted, the comparisons we provide will be versus 2024. All references to our prior expectations, outlook or guidance refer to information provided on our May 28th earnings call. On today's call, we will refer to certain non-GAAP financial measures. Reconciliations of these measures can be found in our earnings presentation and SEC filings available at www.macysinc.com/investors. All references to comp sales throughout today's prepared remarks represent comparable owned-plus-licensed-plus-marketplace sales and owned-plus-licensed sales for",
      "excerpt": "Macy's, Inc. ( NYSE: M ) Q2 2025 Earnings Call September 3, 2025 8:00 AM EDT Company Participants Pamela Quintiliano - Head of Investor Relations Antony Spring - CEO & Chairman Thomas Edwards - COO & CFO Conference Call Participants Matthew Boss - JPMorgan Chase & Co, Research Division Dana Telsey - Telsey Advisory Group LLC Blake Anderson - Jefferies LLC, Research Division Oliver Chen - TD Cowen, Research Division Alexandra Straton - Morgan Stanley, Research Division Tracy Kogan - Citigroup Inc., Research Division Michael Binetti - Evercore ISI Institutional Equities, Research Division Paul Kearney - Barclays Bank PLC, Research Division Jay Sole - UBS Investment Bank, Research Division Janet Kloppenburg - JJK Research Associates, Inc. Presentation Operator Greetings, and welcome to the Macy's, Inc. Second Quarter 2025 Earnings Call.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818949-celestica-the-ai-infrastructure-goldmine-still-climbing?source=feed_all_articles",
      "title": "Celestica: The AI Infrastructure Goldmine Still Climbing (NYSE:CLS)",
      "clean_text": "JHVEPhoto/iStock Editorial via Getty Images Celestica ( NYSE: CLS ) stock has been one of my top picks over the past as since I initiated my bullish coverage on it in March 2024, it's already up ~344%, and although its With just one subscription to Beyond the Wall Investing , you can save thousands of dollars a year on equity research reports from banks. You'll keep your finger on the pulse and have access to the latest and highest-quality analysis of this type of information. This article was written by Oakoff Investments is a personal portfolio manager and a quantitative research analyst with 5 years helping readers find a reasonable balance between growth and value by sharing proprietary Wall Street information. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of CLS either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "JHVEPhoto/iStock Editorial via Getty Images Celestica ( NYSE: CLS ) stock has been one of my top picks over the past as since I initiated my bullish coverage on it in March 2024, it's already up ~344%, and although its With just one subscription to Beyond the Wall Investing , you can save thousands of dollars a year on equity research reports from banks. You'll keep your finger on the pulse and have access to the latest and highest-quality analysis of this type of information. This article was written by Oakoff Investments is a personal portfolio manager and a quantitative research analyst with 5 years helping readers find a reasonable balance between growth and value by sharing proprietary Wall Street information. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of CLS either through stock ownership, options, or other derivatives.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818873-ashtead-group-plc-ashty-q1-2026-earnings-call-transcript?source=feed_all_articles",
      "title": "Ashtead Group Plc (ASHTY) Q1 2026 Earnings Call Transcript",
      "clean_text": "Ashtead Group plc ( OTCPK:ASHTY ) Q1 2026 Earnings Call September 3, 2025 6:30 AM EDT Company Participants Brendan Horgan - CEO & Executive Director Alexander Pease - Chief Financial Officer Conference Call Participants Annelies Vermeulen - Morgan Stanley, Research Division Suhasini Varanasi - Goldman Sachs Group, Inc., Research Division William Kirkness - Sanford C. Bernstein & Co., LLC., Research Division Robert Wertheimer - Melius Research LLC James Rosenthal - Barclays Bank PLC, Research Division Katie Fleischer - KeyBanc Capital Markets Inc., Research Division Rory Mckenzie - UBS Investment Bank, Research Division Allen Wells - Jefferies LLC, Research Division Carl Raynsford - Joh. Berenberg, Gossler & Co. KG, Research Division Presentation Operator Hello, and welcome to the Ashtead Group plc Q1 Results Analyst Call. I'll shortly be handing you over to Brendan Horgan and Alex Pease, who will take you through today's presentation. [Operator Instructions] For now, over to Brendan Horgan and Alex Pease of Ashtead Group plc. Please go ahead. Brendan Horgan CEO & Executive Director Great. Thank you, operator. Good morning. Thank you for joining, and welcome to the Ashtead Group Q1 Results Presentation. I'm speaking to you this morning from our support office in Fortville, South Carolina, where I'm joined by Alex Pease and Kevin Powers, with Will Shaw on the line from London. Given this is the first quarter, we'll keep this relatively brief. You'll see we've updated the presentation format a bit as we do from time to time. But as usual, I'll start with safety on Slide 4. To begin, I'd like to address our Sunbelt team members listening in, specifically recognizing their leadership and help and safety of our people, our customers and the members of the communities we serve. In particular, I'd like to acknowledge our professional drivers, who are on the road every day and lead from the front in our obsession",
      "excerpt": "Ashtead Group plc ( OTCPK:ASHTY ) Q1 2026 Earnings Call September 3, 2025 6:30 AM EDT Company Participants Brendan Horgan - CEO & Executive Director Alexander Pease - Chief Financial Officer Conference Call Participants Annelies Vermeulen - Morgan Stanley, Research Division Suhasini Varanasi - Goldman Sachs Group, Inc., Research Division William Kirkness - Sanford C. Bernstein & Co., LLC., Research Division Robert Wertheimer - Melius Research LLC James Rosenthal - Barclays Bank PLC, Research Division Katie Fleischer - KeyBanc Capital Markets Inc., Research Division Rory Mckenzie - UBS Investment Bank, Research Division Allen Wells - Jefferies LLC, Research Division Carl Raynsford - Joh. Berenberg, Gossler & Co. KG, Research Division Presentation Operator Hello, and welcome to the Ashtead Group plc Q1 Results Analyst Call.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818951-partners-group-great-business-expensive-stock?source=feed_all_articles",
      "title": "Partners Group: Great Business, Expensive Stock (OTCMKTS:PGPHF)",
      "clean_text": "Wasan Tita/iStock via Getty Images Partners Group Holding AG ( OTCPK:PGPHF ) is a Swiss investment company that handles around $174 billion in private equity , infrastructure, real estate, and private credit. In early 2025, it increased its assets under management, upped its This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Wasan Tita/iStock via Getty Images Partners Group Holding AG ( OTCPK:PGPHF ) is a Swiss investment company that handles around $174 billion in private equity , infrastructure, real estate, and private credit. In early 2025, it increased its assets under management, upped its This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-steadies-at-1108k-amid-caution-over-us-rates-tariffs-4220643",
      "title": "Bitcoin price today: little changed at $111.5k amid caution over US rates, tariffs By Investing.com",
      "clean_text": "Investing.com-- Bitcoin stabilized on Wednesday after recouping some recent losses, although traders were seen remaining largely cautious towards crypto markets amid uncertainty over U.S. trade tariffs and lower interest rates. Safe havens such as gold and the U.S. dollar outpaced Bitcoin this week, as rising concerns over high debt levels in the developed world also added to risk aversion. Caution ahead of key U.S. labor data this week, which is likely to factor into the outlook for U.S. rates, also weighed. Bitcoin rose 0.25% to $111,580 by 09:33 ET (13:33 GMT). Increased Bitcoin buying by world no.1 corporate holder Strategy, formerly MicroStrategy (NASDAQ: MSTR ), did little to buoy prices. The Michael Saylor-led firm purchased about 4,048 Bitcoin for nearly $450 million in the last week of August. Elsewhere, digital tokens belonging to U.S. President Donald Trump’s crypto venture– World Liberty Financial– tumbled during debut in public markets earlier this week. The world’s largest crypto had fallen to a two-month low of around $107,000 earlier in the week, leading broader declines in crypto markets. It had tumbled some 12% from a record high hit in mid-August. Bitcoin’s recent losses also coincided with a sharp decline in Wall Street, as risk-driven assets were spooked by rising bond yields across major economies. Markets were on edge ahead of closely watched reading on the U.S. labor market this week, with nonfarm payrolls data due on Friday. Any signs of further deterioration in the labor sector could prime the Federal Reserve to cut interest rates later this month, although a weakening labor market also presents increased risks around the U.S. economy. Weak purchasing managers index readings for August furthered this notion. Still, markets maintained an over 90% probability that the Fed will cut rates by 25 basis points in September, CME Fedwatch showed. Uncertainty over U.S. trade tariffs also weighed, after an appeals court ruled that most President Donald Trump’s trade levies were illegal, and will need to be withdrawn by October 14. Trump signaled that he will appeal the decision with the Supreme Court, adding to the list of ongoing legal challenges faced by his administration. Trump’s attempts to fire Fed Governor Lisa Cook were also met with legal resistance, with the case likely to head to the top U.S. court. Bitcoin largely tracks U.S. technology stocks, and had fallen in tandem with the NASDAQ Composite in recent sessions. Rising bond yields across the globe, amid concerns over stretched government debt levels in the developed world, spooked traders. Some crypto assets can now be traded with the joint approval of both U.S. market watchdogs, according to a Tuesday statement from the Securities and Exchange Commission (SEC) and the Commodity Futures Trading Commission (CFTC). The agencies said that registered platforms under their oversight are permitted to handle such products. The move marks a sharp departure from the cautious approach of the prior administration. Under President Donald Trump, a vocal supporter of the industry and an increasingly active participant through his family business, regulators have acted quickly to open the door for digital assets to enter the existing financial framework. The SEC and the CFTC said they are “coordinating efforts to facilitate the trading of certain spot crypto asset products on registered exchanges.” Their work — the SEC’s “Project Crypto” and the CFTC’s “crypto sprint” — is aimed at fulfilling Trump’s directive to establish the U.S. as a leading hub for digital assets. According to the agencies, CFTC-registered designated contract markets, foreign boards of trade, and SEC-registered national securities exchanges “are not prohibited from facilitating the trading of certain spot crypto asset products.” They encouraged those entities to reach out to staff for guidance. “Market participants should have the freedom to choose where they trade spot crypto assets,” SEC",
      "excerpt": "Investing.com-- Bitcoin stabilized on Wednesday after recouping some recent losses, although traders were seen remaining largely cautious towards crypto markets amid uncertainty over U.S. trade tariffs and lower interest rates. Safe havens such as gold and the U.S. dollar outpaced Bitcoin this week, as rising concerns over high debt levels in the developed world also added to risk aversion. Caution ahead of key U.S. labor data this week, which is likely to factor into the outlook for U.S. rates, also weighed. Bitcoin rose 0.25% to $111,580 by 09:33 ET (13:33 GMT). Increased Bitcoin buying by world no.1 corporate holder Strategy, formerly MicroStrategy (NASDAQ: MSTR ), did little to buoy prices. The Michael Saylor-led firm purchased about 4,048 Bitcoin for nearly $450 million in the last week of August. Elsewhere, digital tokens belonging to U.S.",
      "source": "Investing.com"
    },
    {
      "link": "https://www.bbc.co.uk/sounds/play/p0m0fw7d?at_medium=RSS&at_campaign=rss",
      "title": "Americast - Why is Trump targeting America's most powerful bank? - BBC Sounds",
      "clean_text": "Can he take control of the Federal Reserve? Read more now playing Why is Trump targeting America's most powerful bank? Can he take control of the Federal Reserve?",
      "excerpt": "Can he take control of the Federal Reserve? Read more now playing Why is Trump targeting America's most powerful bank? Can he take control of the Federal Reserve?",
      "source": "feeds.bbci"
    },
    {
      "link": "https://www.bbc.com/sport/football/articles/c5ypyyj3xlro?at_medium=RSS&at_campaign=rss",
      "title": "V11 group: MPs want investigation into case of ex-Premier League players who lost money",
      "clean_text": "The V11 group are campaigning for a change in the law to protect victims of crime from serious tax charges Three parliamentarians are calling for an investigation into the case of a group of former Premier League players who say they were victims of \"financial abuse\". Danny Murphy, Brian Deane and Rod Wallace are part of the V11 campaign group, which comprises 11 footballers who invested with Kingsbridge Asset Management in the 1990s and 2000s. The players lost tens of millions of pounds and some now owe millions in tax. Lord Mann, Alex Sobel MP and Sarah Bool MP said the case was \"a failure of regulation, accountability and duty of care\". They were speaking in response to the BBC documentary Football's Financial Shame: The Story of the V11, which aired on Tuesday. David McKee and Kevin McMenamin, who ran Kingsbridge, have denied any wrongdoing. They told the BBC: \"At all times Kingsbridge advised in good faith and set out the risks and opportunities both before and after any investment was agreed.\" Former footballers lost millions in investments Footballâ\u0080\u0099s Financial Shame: The Story of the V11 Up to 200 footballers may have been affected, with some losing their homes and being made bankrupt. \"This was not a case of greed or bad decisions,\" said the cross-party parliamentarians. \"These men did what we ask of everyone - they saved for their futures, trusted regulated professionals and followed advice they believed was sound. \"We believe that these victims have been failed by not only their advisers but also the financial services sector, by regulatory and law enforcement bodies, by HMRC, and by the football industry.\" City of London Police opened an investigation in 2018. Two years later it was closed, with the force concluding there was \"insufficient evidence to support a realistic prospect of conviction\". No charges were brought against Kingsbridge staff. Lord Mann, Sobel and Bool have called for \"a thorough investigation into the conduct of all advisers and schemes involved\" and \"a fair and timely resolution to the decade-long tax dispute\". Bool said she wants \"to see a leniency package put in place by HMRC\" for the V11 group. In a statement HMRC said: \"We have a duty to collect tax when it is legally due. \"We recognise that dealing with an enquiry and a large tax liability can be stressful and we are absolutely committed to identifying and supporting customers who need extra help.\"",
      "excerpt": "The V11 group are campaigning for a change in the law to protect victims of crime from serious tax charges Three parliamentarians are calling for an investigation into the case of a group of former Premier League players who say they were victims of \"financial abuse\". Danny Murphy, Brian Deane and Rod Wallace are part of the V11 campaign group, which comprises 11 footballers who invested with Kingsbridge Asset Management in the 1990s and 2000s. The players lost tens of millions of pounds and some now owe millions in tax. Lord Mann, Alex Sobel MP and Sarah Bool MP said the case was \"a failure of regulation, accountability and duty of care\". They were speaking in response to the BBC documentary Football's Financial Shame: The Story of the V11, which aired on Tuesday. David McKee and Kevin McMenamin, who ran Kingsbridge, have denied any wrongdoing.",
      "source": "feeds.bbci"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/us-bank-resumes-bitcoin-custody-services-for-institutional-managers-432SI-4221560",
      "title": "U.S. Bank resumes bitcoin custody services for institutional managers By Investing.com",
      "clean_text": "U.S. Bank announced it has resumed cryptocurrency custody services for institutional investment managers through an early access program, according to a press release statement. The bank originally launched these services in 2021 before pausing them. The services target institutional investment managers with registered or private funds seeking secure bitcoin storage solutions. NYDIG will serve as the bitcoin sub-custodian for the program, which is available to Global Fund Services clients. The bank has expanded its offering to include bitcoin ETFs, citing greater regulatory clarity as a factor in the resumption. Stephen Philipson, vice chair of U.S. Bank Wealth, Corporate, Commercial and Institutional Banking, stated the expansion allows the bank to provide full-service solutions for managers seeking custody and administration services. U.S. Bank’s Wealth, Corporate, Commercial and Institutional Banking division holds more than $11.7 trillion in assets under custody and administration as of June 30, 2025. The parent company, U.S. Bancorp (USB) , has approximately 70,000 employees and $686 billion in assets. NYDIG, a bitcoin financial services and power infrastructure company, operates within Stone Ridge Holdings Group. Tejas Shah, CEO of NYDIG, said the partnership aims to bridge traditional finance and digital assets for institutional clients. The custody services complement U.S. Bank’s existing offerings, which include alternative investment services, ETF and fund custody, fund administration, asset management, corporate trust and wealth management services.",
      "excerpt": "U.S. Bank announced it has resumed cryptocurrency custody services for institutional investment managers through an early access program, according to a press release statement. The bank originally launched these services in 2021 before pausing them. The services target institutional investment managers with registered or private funds seeking secure bitcoin storage solutions. NYDIG will serve as the bitcoin sub-custodian for the program, which is available to Global Fund Services clients. The bank has expanded its offering to include bitcoin ETFs, citing greater regulatory clarity as a factor in the resumption. Stephen Philipson, vice chair of U.S. Bank Wealth, Corporate, Commercial and Institutional Banking, stated the expansion allows the bank to provide full-service solutions for managers seeking custody and administration services. U.S.",
      "source": "Investing.com"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/alphaton-capital-raises-73m-to-build-ton-token-treasury-432SI-4221762",
      "title": "AlphaTON Capital raises $73M to build TON token treasury By Investing.com",
      "clean_text": "AlphaTON Capital Corp, formerly Portage Biotech Inc., announced a financing arrangement to raise approximately $73 million for acquiring TON tokens and establishing a digital asset treasury focused on the Telegram ecosystem. The company entered securities purchase agreements for a private placement of about 6.7 million ordinary shares at $5.73 per share, generating expected gross proceeds of approximately $38.2 million. Additionally, AlphaTON secured a $35 million loan facility with BitGo Prime, LLC, collateralized by TON tokens. The financing is expected to close around September 5, 2025, and proceeds will primarily fund the acquisition of approximately $100 million in TON tokens. The company plans to implement a treasury strategy that includes token acquisition, network validation, staking operations, and ecosystem development within Telegram’s platform. Brittany Kaiser has been appointed as Chief Executive Officer and board member. Kaiser previously served as a director at Gryphon Digital Mining (GRYP) and co-founded the Own Your Data Foundation. Enzo Villani, founder of Alpha Transform Holdings, will join as Executive Chairman and Chief Investment Officer. The company rebranded from Portage Biotech Inc. and will begin trading under the ticker symbol \"ATON\" on NASDAQ starting September 4, 2025, replacing its previous \"PRTG\" symbol. AlphaTON’s strategy encompasses three components: building a digital asset treasury through TON token purchases, generating yield through network validation and staking, and developing projects within Telegram’s mini app ecosystem. The company aims to provide public market access to the TON blockchain and Telegram’s ecosystem of over one billion monthly active users. Chardan served as placement agent for the private placement. The securities have not been registered under the Securities Act of 1933 and may not be resold without registration or an applicable exemption.",
      "excerpt": "AlphaTON Capital Corp, formerly Portage Biotech Inc., announced a financing arrangement to raise approximately $73 million for acquiring TON tokens and establishing a digital asset treasury focused on the Telegram ecosystem. The company entered securities purchase agreements for a private placement of about 6.7 million ordinary shares at $5.73 per share, generating expected gross proceeds of approximately $38.2 million. Additionally, AlphaTON secured a $35 million loan facility with BitGo Prime, LLC, collateralized by TON tokens. The financing is expected to close around September 5, 2025, and proceeds will primarily fund the acquisition of approximately $100 million in TON tokens. The company plans to implement a treasury strategy that includes token acquisition, network validation, staking operations, and ecosystem development within Telegram’s platform.",
      "source": "Investing.com"
    }
  ],
  "total_articles": 15,
  "cleaned_at": "2025-09-07T16:41:27.166376"
}