{
  "date": "20250831",
  "data_type": "articles",
  "saved_at": "2025-08-31T09:00:15.604246",
  "articles": [
    {
      "article_id": "acc8f47ed926cfba9b5d993952aa3b0997933e18",
      "url": "https://www.bbc.com/news/articles/cp890n51684o?at_medium=RSS&at_campaign=rss",
      "canonical_url": "https://www.bbc.com/news/articles/cp890n51684o",
      "source": "feeds.bbci",
      "title": "Tories pledge to get 'all our oil and gas out of the North Sea'",
      "authors": null,
      "published_at": null,
      "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/468a/live/43964620-85fc-11f0-9cf6-cbf3e73ce2b9.jpg",
      "lang": "en-GB",
      "summary": "The government warns Kemi Badenoch's plans would \"only accelerate the worsening climate crisis\".",
      "text": "Kemi Badenoch has said her party will remove all net zero requirements on oil and gas companies drilling in the North Sea if elected.\n\nThe Conservative leader is to formally announce the plan to focus solely on \"maximising extraction\" to get \"all our oil and gas out of the North Sea\" in a speech in Aberdeen on Tuesday,\n\nShe will claim that net zero measures mean households end up \"paying the price through higher energy bills\".\n\nThe Labour government has committed to banning new exploration licences. A spokesperson said: \"We'll take no lectures from Kemi Badenoch. Every family and business paid the price of the Conservatives' failure to secure the UK's energy.\"\n\nExploring new fields would \"not take a penny off bills\" or improve energy security and would \"only accelerate the worsening climate crisis\", a government spokesperson warned.\n\nBadenoch signalled a significant change in Conservative climate policy when she announced earlier this year that reaching net zero would be \"impossible\" by 2050 .\n\nSuccessive UK governments have pledged to reach the target by 2050 and it was written into law by Theresa May in 2019. It means the UK must cut carbon emissions until it removes as much as it produces, in line with the 2015 Paris Climate Agreement.\n\nNow Badenoch has said that requirements to work towards net zero are a burden on oil and gas producers in the North Sea which are damaging the economy and which she would remove.\n\nThe Tory leader said a Conservative government would scrap the need to reduce emissions or to work on technologies such as carbon storage.\n\nBadenoch said it was \"absurd\" the UK was leaving \"vital resources untapped\" while \"neighbours like Norway extracted them from the same sea bed\".\n\nHer plan echoes US President Donald Trump's pledge to \"drill, baby, drill\" and embark on new oil and gas exploration. It is a reversal of former President Joe Biden's Inflation Reduction Act, which channelled billions of dollars into clean energy.\n\nIn 2023, then Prime Minister Rishi Sunak granted 100 new licences to drill in the North Sea which he said at the time was \"entirely consistent\" with net zero commitments.\n\nSince then, major energy companies such as BP have U-turned on the level of investment in renewables to focus on increasing oil and gas production in order to boost profitability.\n\nTessa Khan, executive director of Uplift, a research and campaign group, said Badenoch's plan was \"reckless\" and would not \"bring down energy bills\".\n\n\"These rules are the bare minimum to needed hold the industry to account, and removing them will simply mean more emissions, more environmental harm and more handouts to oil and gas giants at the nation's expense,\" she said.\n\nReform UK has said it will abolish the push for net zero if elected.\n\nBut Liberal Democrat environment spokesperson Tim Farron said scrapping requirements to reduce emissions \"is nothing short of irresponsible environmental vandalism\".\n\nHe said the UK \"should be setting our sights on leading the world in clean energy, in off shore wind, instead of falling back to a dependency on fossil fuels\".\n\nResearch shows that 2024 was the first calendar year where the average temperature exceeded 1.5°C.\n\nThis made it the hottest year since records began in 1850, according to the Copernicus Climate Change Service, which is managed by the European Commission and uses data from the European Union's space programme.\n\nThe UK was one of 200 countries to sign the Paris Agreement who agreed to \"pursue efforts\" to limit global temperature rises to 1.5C and keep them \"well below\" 2.0C above those recorded in pre-industrial times.\n\nGillian Martin, the Scottish government's energy secretary, said: \"Too many are offering easy answers when what we need are the right answers.\"\n\nShe said that because the North Sea basin is \"maturing\", the \"responsible approach is to plan now for this eventuality, transitioning to new fuels and sustainable energy in a way that protects our energy security and Scotland's highly skilled workforce in the North East\".\n\nBut David Whitehouse, chief executive of Offshore Energies UK, a trade organisation representing the industry, said: \"The choice is clear - do we prioritise our homegrown energy or choose to sacrifice our jobs to rely on imports?\n\n\"While we use oil and gas, let us produce it here in the UK responsibly, alongside an accelerated rollout of renewables. In a country importing 40% of its energy needs, we need both.\"\n\nThe current government said it had made the \"biggest ever investment in offshore wind and three first of a kind carbon capture and storage clusters\".\n\nCarbon capture and storage facilities aim to prevent carbon dioxide (CO2) produced from industrial processes and power stations from being released into the atmosphere.\n\nMost of the CO2 produced is captured, transported and then stored deep underground.\n\nIt is seen by the likes of the International Energy Agency and the Climate Change Committee as a key element in meeting targets to cut the greenhouse gases driving dangerous climate change.\n\nGreen Party MP Ellie Chowns, said: \"By far the best option for British growth, British jobs is investment in that green industrial transformation. Not the technology of the old century the 20th century, we need to invest in the technology of the 21st century.\"\n\nAdditional reporting by Dearbail Jordan.",
      "word_count": 877,
      "headline_text": "Tories pledge to get all oil and gas out of North Sea",
      "category": "general_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:13.145440"
    },
    {
      "article_id": "6dcd845438893012a1d07617a339a7e785a6c3af",
      "url": "https://seekingalpha.com/article/4818177-blackrock-strategic-global-bond-fund-q2-2025-commentary?source=feed_all_articles",
      "canonical_url": null,
      "source": "Seeking Alpha",
      "title": "BlackRock Strategic Global Bond Fund Q2 2025 Commentary",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "BlackRock Strategic Global Bond Fund Q2 2025 Commentary",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:13.146455"
    },
    {
      "article_id": "c3048660f1ace03a3afdfc027402f4f17c1a73a9",
      "url": "https://seekingalpha.com/article/4817267-analyst-connect-august-2025-earnings-coverage-reminders-top-15-revealed-old-school-investment-wisdom?source=feed_all_articles",
      "canonical_url": null,
      "source": "Seeking Alpha",
      "title": "Analyst Connect August 2025: Earnings Coverage Reminders, Top 15 Revealed, And 'Old School' Investment Wisdom",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Analyst Connect August 2025: Earnings Coverage Reminders, Top 15 Revealed, And 'Old School' Investment Wisdom",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:14.012813"
    },
    {
      "article_id": "10b721f6f4fb926c1b3801f32023e84be1ee9bfb",
      "url": "https://seekingalpha.com/article/4818163-brt-apartments-buy-the-dip-opportunity-as-portfolio-growth-continues?source=feed_all_articles",
      "canonical_url": null,
      "source": "Seeking Alpha",
      "title": "BRT Apartments: Buy The Dip Opportunity As Portfolio Growth Continues",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "BRT Apartments: Buy The Dip Opportunity As Portfolio Growth Continues",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:14.124695"
    },
    {
      "article_id": "f7ea2180979dc5f9e39cc5d25006964acd90290c",
      "url": "https://seekingalpha.com/article/4818157-broadcom-earnings-preview-premium-valuation-premium-risks-rating-upgrade?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4818157-broadcom-earnings-preview-premium-valuation-premium-risks-rating-upgrade",
      "source": "Seeking Alpha",
      "title": "Broadcom Earnings Preview: Premium Valuation, Premium Risks (Rating Upgrade) (NASDAQ:AVGO)",
      "authors": null,
      "published_at": "2025-08-31T09:30:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2187470060/image_2187470060.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Broadcomâ\u0080\u0099s Q3 earnings will test AI growth and margin strength, with key support at $249.05 offering a potential entry on weakness. Read why AVGO stock is upgraded to buy.",
      "text": "Getty Images\n\nGetty Images\n\nWhen I last covered Broadcom Inc. ( AVGO ) on January 6th, 2025 with my article â\u0080\u009cBroadcom: Vulnerable To Bearish Reversals,â\u0080\u009d the stock was trading near long-term highs following a significant rally that saw a near-doubling in share\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of AVGO, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 195,
      "headline_text": "Broadcom Earnings Preview: Premium Valuation, Premium Risks (Rating Upgrade)",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:14.135429"
    },
    {
      "article_id": "1d5140c55c421819d9f2317a27b9d96bc764126e",
      "url": "https://seekingalpha.com/article/4818166-inflation-stable-now?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4818166-inflation-stable-now",
      "source": "Seeking Alpha",
      "title": "Inflation: Stable Now",
      "authors": null,
      "published_at": "2025-08-31T09:18:34-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2229591985/image_2229591985.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "July results came in strong, with key metrics beating expectations and supporting a bullish economic outlook. Find out why future performance looks promising.",
      "text": "grdenis/iStock via Getty Images\n\ngrdenis/iStock via Getty Images\n\nThe July numbers are out.\n\nAll-in-all, the numbers are pretty good.\n\nEconomic growth remains modest, but above 2.0 percent.\n\nUnemployment remains constant at around 4.2 percent.\n\nAnd, now we hear that, year-over-year, the rate of inflation, using the preferred\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 208,
      "headline_text": "Inflation: Stable Now",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:14.199749"
    },
    {
      "article_id": "1557563d0a8443cb52be875303a14b9897a5925c",
      "url": "https://seekingalpha.com/article/4818123-flawed-jobs-data-threatens-fed-september-rate-cut?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4818123-flawed-jobs-data-threatens-fed-september-rate-cut",
      "source": "Seeking Alpha",
      "title": "Flawed Jobs Data Threatens Fedâ\u0080\u0099s September Rate Cut",
      "authors": null,
      "published_at": "2025-08-31T09:55:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2225545768/image_2225545768.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Market tension is high as September's Fed rate decision hinges on the upcoming, unreliable August jobs report. Learn more about the market here.",
      "text": "Andrew Harnik/Getty Images News\n\nAndrew Harnik/Getty Images News\n\nThe tension in the market is building, and this week's economic data is likely to decide whether the Fed cuts rates at its September FOMC meeting. The market is currently assigning a roughly 85% chance of a September\n\nEnjoying this article? Youâ\u0080\u0099ll find my investing group a valuable tool for your research.\n\nReading The Markets delivers daily, institutional-style updates with written commentary, videos, transcripts, and glossaries. The focus is on finding balance and alpha across asset classes.\n\nIf you value advanced, independent market analysis and want deeper insight into macro drivers of equities, rates, credit, and commodities, join us .\n\nThis article was written by\n\nMichael Kramer is the founder of Mott Capital, and is a long-only investor who focuses on macro themes and studies trends and options activities to identify and assess entry and exit points for investments in his long-term focused thematic growth strategy. He is a former buy-side trader, analyst, and portfolio manager with 30 years of experience tracking market technicals, fundamentals, and options.\n\nMichael Kramer leads the investing group Reading the Markets, where he helps a devoted following of members to better understand what is driving trading and where the market is likely heading, both the short and long-term. Features of the investing group include: daily written commentary and videos analyzing the driving factors behind price action; general macro trend education to help members make well-informed decisions based on market conditions, interest rates, currency movements and how they all interact; chat for questions and community dialogue; and regular Zoom videos sessions to discuss current ideas and answer questions. The level of access RTM subscribers and the expertise of the source are unprecedented given that the subscription price is a fraction of similar technical coaching and mentoring services.\n\nLearn more.\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. This report contains independent commentary to be used for informational and educational purposes only. Michael Kramer is a member and investment adviser representative with Mott Capital Management. Mr. Kramer is not affiliated with this company and does not serve on the board of any related company that issued this stock. All opinions and analyses presented by Michael Kramer in this analysis or market report are solely Michael Kramerâ\u0080\u0099s views. Readers should not treat any opinion, viewpoint, or prediction expressed by Michael Kramer as a specific solicitation or recommendation to buy or sell a particular security or follow a particular strategy. Michael Kramerâ\u0080\u0099s analyses are based upon information and independent research that he considers reliable, but neither Michael Kramer nor Mott Capital Management guarantees its completeness or accuracy, and it should not be relied upon as such. Michael Kramer is not under any obligation to update or correct any information presented in his analyses. Mr. Kramerâ\u0080\u0099s statements, guidance, and opinions are subject to change without notice. Past performance is not indicative of future results. Neither Michael Kramer nor Mott Capital Management guarantees any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment commentary presented in this analysis. Strategies or investments discussed may fluctuate in price or value. Investments or strategies mentioned in this analysis may not be suitable for you. This material does not consider your particular investment objectives, financial situation, or needs and is not intended as a recommendation appropriate for you. You must make an independent decision regarding investments or strategies in this analysis. Upon request, the advisor will provide a list of all recommendations made during the past twelve months. Before acting on information in this analysis, you should consider whether it is suitable for your circumstances and strongly consider seeking advice from your own financial or investment adviser to determine the suitability of any investment.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 776,
      "headline_text": "Flawed Jobs Data Threatens Fed's September Rate Cut",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:14.262253"
    },
    {
      "article_id": "e1be1853a69a99a311c6b28eb109673c1a3499a0",
      "url": "https://seekingalpha.com/article/4818162-august-job-report-preview-weak-report-to-cement-september-fed-cut?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4818162-august-job-report-preview-weak-report-to-cement-september-fed-cut",
      "source": "Seeking Alpha",
      "title": "August Job Report Preview: Weak Report To Cement The September Fed Cut",
      "authors": null,
      "published_at": "2025-08-31T09:15:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2226866961/image_2226866961.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Job losses in cyclical sectors point to a recession and support a Fed rate cut in September, though labor force shifts could complicate things. See why data may diverge.",
      "text": "Chip Somodevilla/Getty Images News\n\nChip Somodevilla/Getty Images News\n\nThe US Bureau of Labor Statistics is set to release the August labor market report on Friday, September 5th.\n\nThe consensus market expectations are:\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have a beneficial short position in the shares of SPX either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 184,
      "headline_text": "August Job Report Preview: Weak Report To Cement The September Fed Cut",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:14.319005"
    },
    {
      "article_id": "363d4dbf243330737be37793d8df5e62de30579d",
      "url": "https://www.bbc.com/news/articles/c0mlen3grx7o?at_medium=RSS&at_campaign=rss",
      "canonical_url": "https://www.bbc.com/news/articles/c0mlen3grx7o",
      "source": "feeds.bbci",
      "title": "SCO: China and India attempt to repair strained ties",
      "authors": null,
      "published_at": null,
      "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/a6e5/live/fa131d40-85ef-11f0-84c8-99de564f0440.jpg",
      "lang": "en-GB",
      "summary": "India's prime minister hopes to draw nearer to some of the world’s largest economies.",
      "text": "India's Prime Minister Narendra Modi landed in China on Sunday with the sting of Donald Trump's US tariffs still at the top of his mind.\n\nSince Wednesday, tariffs on Indian goods imported into the US, like diamonds and prawns, now stand at 50% – which the US president says is punishment for Delhi's continued purchase of Russian oil.\n\nExperts say the levies threaten to leave lasting bruises on India's vibrant export sector, and its ambitious growth targets.\n\nChina's President Xi Jinping, too, is trying to revive a sluggish economy at a time when sky-high US tariffs threaten to derail his plans.\n\nAgainst this backdrop, the leaders of the world's two most populous countries may both be looking for a reset in their relationship, which has previously been marked by mistrust, in large part due to border disputes.\n\n\"Put simply, what happens in this relationship matters to the rest of the world,\" Chietigj Bajpaee and Yu Jie of Chatham House wrote in a recent editorial.\n\n\"India was never going to be the bulwark against China that the West (and the United States in particular) thought it was... Modi's China visit marks a potential turning point.\"\n\nIndia and China are economic powerhouses – the world's fifth- and second-largest, respectively.\n\nBut with India's growth expected to remain above 6% in the coming years, a $4tn (£3tn) economy and $5tn stock market, it is on the way to becoming the third-largest by 2028, according to the International Monetary Fund (IMF).\n\n\"While the world has traditionally focused on the single most important bilateral relationship in the world, US and China, it is time we shift more focus on how the second and would-be third largest economies, China and India, can work together,\" says Qian Liu, founder and chief executive of Wusawa Advisory, based in Beijing.\n\nBut the relationship is deeply challenging.\n\nThe two sides have an unresolved and long-standing territorial dispute that signifies a much broader and deeper rivalry.\n\nViolence erupted across Ladakh's Galwan Valley in June 2020 – the worst period of hostility between the two countries in more than four decades.\n\nThe fallout was largely economic – a return of direct flights was taken off the table, visas and Chinese investments were put on hold leading to slower infrastructure projects, and India banned more than 200 Chinese apps, including TikTok.\n\n\"Dialogue will be needed to help better manage the expectations of other powers who look to India-China as a key factor of Asia's wider stability,\" says Antoine Levesques, senior fellow for South and Central Asian defence, strategy and diplomacy at the International Institute for Strategic Studies.\n\nThere are other fault lines too, including Tibet, the Dalai Lama, and water disputes over China's plans to build the world's largest hydroelectric power project across a river shared by both nations, as well as tensions with Pakistan after the Pahalgam attack.\n\nIndia also does not currently enjoy good relations with most of its neighbours in South Asia, whereas China is a key trading partner for Pakistan, Bangladesh, Sri Lanka and Afghanistan.\n\n\"I would be surprised if a BYD factory is coming to India, but there may be some soft wins,\" says Priyanka Kishore, founder and principal economist at research company Asia Decoded.\n\nIt's already been announced that direct flights will resume, there may be more relaxations on visas, and other economic deals.\n\nHowever, the relationship between Delhi and Beijing is \"an uncomfortable alliance to be sure\", notes Ms Kishore.\n\n\"Remember at one point, the US and India were coming together to balance China,\" she adds.\n\nBut India is completely perplexed with the US and its position: \"So it's a smart move – and feeds into the multipolar narrative that both India and China believe in.\"\n\nModi is travelling to China for the Shanghai Co-operation Organisation (SCO) - a regional body aimed at projecting an alternative worldview to that of the West. Members include China, India, Iran, Pakistan and Russia.\n\nIn the past, India has downplayed the organisation's significance. And critics say it hasn't delivered on substantial outcomes over the years.\n\nThe June SCO defence ministers' meeting failed to agree on a joint statement. India raised objections over the omission of any reference to the deadly 22 April attack on Hindu tourists in Indian-administered Kashmir, which led to the worst fighting in decades between India and Pakistan.\n\nBut experts say the downturn in Delhi's relations with Washington has prompted India to rediscover the utility of the SCO.\n\nChina, meanwhile, will value the optics of Global South solidarity amid Trump's tariff chaos.\n\nThe Brics grouping - of which China, India, Russia, Brazil and South Africa are founding members - has drawn the ire of Trump, who has threatened to slap additional tariffs on group members on top of their negotiated rates.\n\nModi last met Xi and Russia's Vladimir Putin at the Brics summit in Russia in October 2024. Last week, Russian embassy officials said Moscow hopes trilateral talks with China and India will take place soon.\n\n\"Leveraging each of their advantages - China's manufacturing prowess, India's service sector strengths, and Russia's natural resource endowment - they can work to reduce their dependence on the United States to diversify their export markets and ultimately reshape global trade flows,\" Bajpaee and Yu said in their editorial.\n\nDelhi is also leveraging other regional alliances, with Modi stopping in Japan on the way to China.\n\n\"Asean and Japan would welcome closer co-operation between China and India. It really helps in terms of supply chains and the idea of Make in Asia for Asia,\" Ms Kishore says, referring to the political grouping comprising 10 Southeast Asian economies.\n\nIndia continues to be reliant on China for its manufacturing, because it sources raw materials and components from there. It will likely be looking for lower import duties on goods.\n\nIndia's strict industrial policies have so far held it back from benefiting from the supply chain shift from China to South East Asian countries, according to experts.\n\nThere is a case for partnership, a strong one, says Ms Kishore, where India pitches to manufacture more electronics.\n\nShe points out that Apple makes airpods and wearables in Vietnam, and iPhones in India, and so there would be no overlap.\n\n\"Faster visa approvals would be an easy win for China as well. It wants market access in India either directly or through investments. It's dealing with a shrinking US market, it's already flooded Asean markets, and a lot of Chinese apps like Shein and TikTok are banned in India,\" says Ms Kishore.\n\n\"Beijing would welcome the opportunity to sell to 1.45 billion people.\"\n\nGiven the complexity of the relationship, one meeting is unlikely to change much. There is a long way to go on improving China-India ties.\n\nBut Modi's visit to China could repair some animosity and send a very clear signal to Washington that India has options.",
      "word_count": 1140,
      "headline_text": "Reeling from Trump's tariffs, India and China seek a business reboot",
      "category": "general_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:14.344873"
    },
    {
      "article_id": "262aa57e397cf3cefaff3bdd6a866500c8e43cee",
      "url": "https://www.marketwatch.com/story/is-the-stock-market-open-on-labor-day-does-the-post-office-deliver-mail-bb5eb801?mod=mw_rss_topstories",
      "canonical_url": null,
      "source": "feeds.marketwatch",
      "title": "Is the stock market open tomorrow for Labor Day? Does the post office deliver mail?",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Is the stock market open tomorrow for Labor Day? Does the post office deliver mail?",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 401,
      "error": "http_401",
      "scraped_at": "2025-08-31T09:00:14.422594"
    },
    {
      "article_id": "8e7ff73267c27d1a752fe3b06a89e53d8452a228",
      "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-falls-to-111k-ahead-of-pce-inflation-set-for-monthly-drop-4215840",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "Bitcoin price today: dips to $109k on firm inflation data; set for monthly drop",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Bitcoin price today: dips to $109k on firm inflation data; set for monthly drop",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:14.458620"
    },
    {
      "article_id": "89516692eb235cb5c93f9b7c6be6b5d3562e936b",
      "url": "https://seekingalpha.com/article/4818107-is-googles-golden-era-over-rating-downgrade?source=feed_all_articles",
      "canonical_url": null,
      "source": "Seeking Alpha",
      "title": "Is Alphabet's Golden Era Over (Rating Downgrade)",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Is Alphabet's Golden Era Over (Rating Downgrade)",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:15.068321"
    },
    {
      "article_id": "2e9def7d0d0bd50f975b790f4eb73d5bd81ab012",
      "url": "https://seekingalpha.com/article/4818146-market-efficiency-is-impossible-here-is-why-and-why-it-matters?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4818146-market-efficiency-is-impossible-here-is-why-and-why-it-matters",
      "source": "Seeking Alpha",
      "title": "Market Efficiency Is Impossible: Here Is Why & Why It Matters",
      "authors": null,
      "published_at": "2025-08-31T09:00:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1223598227/image_1223598227.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Stock price efficiency is theoretically impossible due to Hayekâ\u0080\u0099s Knowledge Problem, challenging EMH at its core. See why valuation gaps enable profitable strategies.",
      "text": "DariaRen/iStock via Getty Images\n\nDariaRen/iStock via Getty Images\n\nIn our last article entitled, \" Intrinsic Value is Subjective ,\" we presented decisive empirical evidence that directly falsified the Efficient Market Hypothesis (EMH). We showed that even under conditions where\n\nIf you are really serious about improving your performance as an investor -- during this historic moment, which is providing once-in-a-decade opportunities -- I highly recommend that you subscribe to Successful Portfolio Strategy . This service is designed to empower you to become a successful strategic manager of your investments. Few times in history has it been as important as it is now to have a winning portfolio strategy. So, right now is truly the time to take decisive action.\n\nThis article was written by\n\nJames A. Kostohryz has 20+ years of experience as a global investment professional. He has worked as an analyst at one of the world's largest asset management firms covering emerging markets, banking, energy, construction, real estate, metals and mining. He has also served as Global Portfolio Strategist and Head of International Investments for an investment bank. He is currently managing Investor Acumen, a firm specializing in global portfolio strategy, macro forecasting, and quant analytics.\n\nJames is the leader of the investing group Successful Portfolio Strategy , a service designed to empower investors to achieve investment performance through implementation of a portfolio strategy system. Features include: 2 model portfolios, tactical asset allocation and mentorship for execution, analysis via video and articles, and more. Learn More .\n\nJames also contributes to the group account Investor Acumen on Seeking Alpha.\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. All positions disclosed to members of Successful Portfolio Strategy.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 426,
      "headline_text": "Market Efficiency Is Impossible: Here Is Why And Why It Matters",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:15.316935"
    },
    {
      "article_id": "8e09e44a10e0d2866804fb5bd2ed6aa36c434a42",
      "url": "https://www.bbc.com/news/articles/ce83r56xwj7o?at_medium=RSS&at_campaign=rss",
      "canonical_url": "https://www.bbc.com/news/articles/ce83r56xwj7o",
      "source": "feeds.bbci",
      "title": "The trade in US body parts that's completely legal - but ripe for exploitation",
      "authors": null,
      "published_at": null,
      "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/e090/live/5e5cf420-84e6-11f0-b391-6936825093bd.png",
      "lang": "en-GB",
      "summary": "Human remains can mean profits. But there is an emotional debate about the ethics of the industry.",
      "text": "Harold Dillard was 56 when he was diagnosed with an aggressive cancer around his abdomen in November 2009. Within weeks the former car mechanic and handyman - a Texan \"Mr Fix It\" type who wore a cowboy hat and jeans nearly every day - was in end-of-life hospice care.\n\nIn his final days, Mr Dillard was visited at the hospice by a company called Bio Care. They asked if he might like to donate his body to medical science, where it could be used by doctors to practise knee replacement surgery. The company would cremate the parts of his body that weren't used and return his ashes free of charge.\n\n\"His eyes lit up,\" his daughter, Farrah Fasold, remembers. \"He viewed that as lessening the burden on his family. Donating his body was the last selfless thing he could do.\"\n\nMr Dillard died on Christmas Eve, and within hours, a car from Bio Care pulled up outside the hospice and drove his body away.\n\nA few months later, his daughter received a call from the police. They had found her father's head.\n\nAt the company's warehouse, police say they found more than 100 body parts belonging to 45 people. \"All of the bodies appeared to have been dismembered by a coarse cutting instrument, such as a chainsaw,\" a detective wrote at the time.\n\nMs Fasold says she imagined her father's body would be handled with respect - but instead it was \"mutilated\", she believes.\n\n\"I would close my eyes at night and see huge red tubs filled with body parts. I had insomnia. I wasn't sleeping.\"\n\nThe company said at the time through a lawyer that they denied mistreating bodies. The firm no longer exists, and its former owners could not be reached for comment.\n\nThis was Ms Fasold's first introduction to the world of so-called body brokers: private companies that acquire corpses, dissect them, and then sell the limbs for a profit, often to medical research centres.\n\nFor critics, the industry represents a modern form of grave-robbing. Others argue that body-donation is essential for medical research and that private companies are simply filling a gap left by universities, who consistently fail to acquire enough dead bodies to support their education and research programmes.\n\nAlthough Ms Fasold didn't realise it at the time, her father's case sheds light on an emotion-fuelled debate that cuts to the centre of our ideas about life, and what it means to have a dignified death.\n\nSince at least the 19th Century, when the teaching of medicine expanded, some scientifically-minded people have rather liked the idea that their corpse could be used to train doctors.\n\nBrandi Schmitt is director of the anatomical donation programme at the University of California, a popular destination for people wishing to bequeath their bodies. She says last year they received 1,600 \"whole-body donations\", and they have a list of almost 50,000 living people who have already registered to do so.\n\nOften, body-donation is driven by simple altruism, she says: \"A  lot of people are either educated or interested in education.\"\n\nBut financial factors come into play too. Funerals are expensive, Ms Schmitt says; many are tempted by the prospect of their body being taken away for free.\n\nThe Body Shop\n\nConversations with body brokers, scientists and affected families shed light on this murky industry. Listen on BBC Sounds or on BBC Radio 4 at 13:30 BST on Sunday 31 August. Produced by Jacob Dabb and 2 Degrees West.\n\nLike most medical schools, the University of California does not profit from its body-donation programme, and it has strict guidelines for how corpses - or cadavers, as they are known medically - should be handled.\n\nBut in recent decades, something more controversial has emerged in the US: a network of for-profit businesses that act as middlemen, acquiring bodies from individuals, dissecting them, and then selling them on. They are widely nicknamed body brokers,  though the firms call themselves \"non-transplant tissue banks\".\n\nSome of their customers are universities, which use cadavers to train doctors. Others are medical engineering firms, which use limbs to test products like new hip implants.\n\nThe for-profit body part trade is effectively outlawed in the UK and other European countries, but looser regulation in the US has allowed the trade to flourish.\n\nThe largest investigation of its kind - conducted by Reuters journalist Brian Grow, in 2017 - identified 25 for-profit body broking companies in the US. One of them earned $12.5m (£9.3m) over three years from the body-part business.\n\nSome of those firms are broadly respected, and claim to follow rigorous ethical guidelines. Others have been accused of disrespecting the dead and exploiting vulnerable people in grief.\n\nThe trade has grown because of a gap in US regulation, says Jenny Kleeman, who spent years researching the topic for her book, The Price of Life.\n\nWhilst the UK's Human Tissue Act makes it illegal in almost all cases to profit from a body part, no comparable law exists in the US. Technically, the US's Uniform Anatomical Gift Act bans the sale of human tissue - but the same law allows you to charge a \"reasonable amount\" for the \"processing\" of a body part.\n\nThese loose laws have turned the US into a global exporter of cadavers. In her book, Kleeman found that one of the largest US players shipped body parts to more than 50 countries, including the UK.\n\n\"In many countries, there is a shortfall of donations,\" Ms Kleeman says. \"And where they can get bodies is from America.\"\n\nThere is no formal register of brokers, and official statistics are hard to find. But Reuters calculated that, from 2011 to 2015, private brokers in the US received at least 50,000 bodies, and distributed more than 182,000 body parts.\n\nFor some, private body brokers represent the very worst sort of ambulance-chasing greed.\n\nIn his Reuters investigation, Mr Grow found cases of brokers becoming \"intertwined with the American funeral industry\" via arrangements in which funeral homes introduce brokers to relatives of the recently-deceased. In return, the home received a referral fee, sometimes exceeding $1,000 (£750).\n\nHorror stories are easy to find - and because of the US's light regulation, there's often no legal recourse when things go wrong.\n\nAfter her run-in with Bio Care, Ms Fasold hoped for a criminal prosecution. As well as the fact that her father's limbs may have been cut with a chainsaw, she was unhappy about a package she had received in the post, in a zip-lock bag, which the company claimed was her father's ashes. She says the contents did not look or feel like human ashes.\n\nBio Care's owner was initially charged with fraud, but the charge was later withdrawn because prosecutors could not prove an intent to deceive.\n\nIncreasingly desperate, Ms Fasold contacted the local district prosecutor. But she was told that Bio Care had not broken any state criminal laws.\n\nEqually as controversial are \"bodies of the state\" donations - when a homeless person dies on the street, or somebody dies in hospital without known next-of-kin, and their corpse is donated to science.\n\nIn theory, county officials first try to find relatives; only if they cannot locate anyone is the body given away.\n\nBut the BBC has heard that this may not always happen. Last year, Tim Leggett was scrolling a news app at his home in Texas when he found a list of local people whose bodies had been used in this way. He was shocked to see the name of his older brother, Dale, a forklift truck-operator who had died of respiratory failure a year earlier.\n\nHis brother's body was used by a for-profit medical education company to train anaesthesiologists. It was one of more than 2,000 unclaimed bodies given to the University of North Texas Health Science Center between 2019 and 2024, under agreements with the Dallas and Tarrant counties.\n\n\"I was angry,\" Mr Leggett says. \"He would not want to be an object of discussion, or [to have] people pointing at him.\"\n\nHis brother was a quiet man who mostly \"just wanted to be left alone\", Mr Leggett remembers, and his aversion to technology made it difficult to stay in touch. Still, Mr Leggett says his brother was a human, like anyone else, who deserved dignity in death.\n\n\"He liked Marvel comic books; he had a cat that he named Cat,\" he remembers.\n\nIn a statement to the BBC, the University of North Texas Health Science Center gave its \"deepest apologies\" to the affected families, and said it was \"refocusing\" its programme on education and \"improv[ing] the quality of health for families and future generations\". Since the story first emerged last year, they said, they have fired staff who oversaw the programme.\n\nBut horror stories like these aside, others point out that body donation plays a crucial role in scientific discovery.\n\nMs Schmitt of the University of California says that at the most basic level, bodies are used to teach doctors, or for surgeons to practise complicated operations. Often, it's the first time a medical student works with real flesh and blood - an experience that can't be replicated from a textbook.\n\n\"Those students will go on to help people,\" she says.\n\nThen there are the cadavers used to help engineer new treatments. Ms Schmitt points to a number of technologies that were only developed, she says, after being tested on bodies. These include knee and hip replacements, robotic surgery, and pacemakers.\n\nAnd some of the private brokers say they are being unfairly villainised. Kevin Lowbrera, who works for one of the big \"body broking\" companies, says its accreditation by the American Association of Tissue Banks means it has to follow guidelines determining how cadavers are treated and stored. Accreditation is voluntary - seven companies have signed up - and a private broker doesn't need it to operate legally.\n\nThe problem is not with honest companies like his, Mr Lowbrera says - it is with the rogue players. \"There are still programmes out there that are not accredited. I tell people all the time, stay away from them,\" he says.\n\nIt would be wrong to regulate his whole industry out of existence, he says, because of some bad apples.\n\nVirtually everyone I speak to - on all sides of the debate - thinks that more regulation in the US is needed.\n\nSo, what could that look like?\n\nMs Schmitt, of the University of California, suggests the US could perhaps follow European countries and ban for-profit body broking.\n\nShe says there are some \"legitimate costs\" that come with processing a body - like spending on transport, and preservative chemicals. It's reasonable for companies to charge for these, she says. But the idea of actually making a profit makes many feel squeamish. \"The ability to sell or profit from human remains I think complicates the altruistic idea of donating for education,\" she says.\n\nShe suggests the US could emulate its own policy on organ donation - which is governed by the Uniform Anatomical Gift Act, and prohibits the sale of organs.\n\nBut the author Ms Kleeman says that if the US banned for-profit body donation tomorrow, there simply wouldn't be enough cadavers to go around.\n\n\"If you don't want there to be a trade in these body parts, we need to get a way of more people donating altruistically,\" she says.\n\nShe urges universities to launch more robust promotional campaigns, asking directly for body donations. \"There isn't the same public awareness campaign as there is for organ donation, for example.\"\n\nOnce this shortage is addressed, she says, then the US could ban for-profit donation.\n\nIt's also possible that advances in virtual reality (VR) technology mean that cadavers simply won't be needed in the future. A trainee doctor could simply put on a headset and practice on a computer-generated patient.\n\nIn 2023, Case Western Reserve University became one of the first medical schools in the United States to remove human bodies from its training programme, and replace them with VR models.\n\nReal human bodies preserve the \"body's colours and textures, [which] can make it difficult to discern, say, a nerve from a blood vessel\", Mark Griswold, a professor at the school, told the website Lifewire at the time. In contrast, their computer programme \"gives students a crystal clear 3D map of these anatomical structures and their relationships to each other\", he said.\n\nBut Ms Kleeman says that, in general, VR technology is not yet good enough to replicate practicing on a cadaver.\n\nFor the time being, it seems, there will remain a demand for human bodies - as well as money to be made.\n\nAdditional reporting: Jacob Dabb\n\nBBC InDepth is the home on the website and app for the best analysis, with fresh perspectives that challenge assumptions and deep reporting on the biggest issues of the day. And we showcase thought-provoking content from across BBC Sounds and iPlayer too. You can send us your feedback on the InDepth section by clicking on the button below.",
      "word_count": 2166,
      "headline_text": "The trade in US body parts that's completely legal - but ripe for exploitation",
      "category": "general_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-31T09:00:15.424967"
    },
    {
      "article_id": "ee0e1a4ad2a15f835cb6b30696da4530450cd81c",
      "url": "https://www.investing.com/news/cryptocurrency-news/bybit-adds-tokenized-gold-xaut-to-ton-network-with-earn-yields-up-to-100-4216013",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "Bybit Adds Tokenized Gold (XAUT) to TON Network With Earn Yields Up to 100%",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Bybit Adds Tokenized Gold (XAUT) to TON Network With Earn Yields Up to 100%",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:15.576657"
    },
    {
      "article_id": "06755bab9e90d9b2227e9ec93e1cbc0cbedd075a",
      "url": "https://www.investing.com/news/cryptocurrency-news/gate-launches-gusd-a-stable-investment-backed-by-realworld-assets-4215951",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "Gate Launches GUSD: A Stable Investment Backed by Real-World Assets",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Gate Launches GUSD: A Stable Investment Backed by Real-World Assets",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:15.584873"
    },
    {
      "article_id": "0a7161d28f0d6f8a60de95172ab5e3b2f27bed6a",
      "url": "https://www.investing.com/news/cryptocurrency-news/defi-development-launches-solana-treasury-vehicle-in-uk-market-432SI-4216566",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "DeFi Development launches Solana treasury vehicle in UK market",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "DeFi Development launches Solana treasury vehicle in UK market",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-31T09:00:15.600240"
    }
  ],
  "total_articles": 17,
  "collected_at": "2025-08-31T09:00:15.604219"
}