{
  "date": "20250826",
  "data_type": "articles",
  "saved_at": "2025-08-26T23:48:59.555369",
  "articles": [
    {
      "article_id": "daaaf0d9cde29ca529d017997da6cff0c7e88478",
      "url": "https://seekingalpha.com/article/4817007-above-noise-positive-signs-us-economy-markets?source=feed_all_articles",
      "canonical_url": "https://www.invesco.com/us/en/insights/economy-market-advance-ipo-weak-dollar.html",
      "source": "Seeking Alpha",
      "title": "Above The Noise: Positive Signs For U.S. Economy And Markets",
      "authors": null,
      "published_at": "2025-08-27T02:40:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1467596967/image_1467596967.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Only 9.5% of senior loan officers report tightening standards, far below the 50%-60% typical recession levels. Read more here.",
      "text": "welcomia/iStock via Getty Images\n\nwelcomia/iStock via Getty Images\n\nBy Brian Levitt, Global Market Strategist\n\nWhy do people keep asking me whether I think 100 unarmed humans could defeat a fully grown silverback gorilla in a fight to the death? I have so many follow-up\n\nThis article was written by",
      "word_count": 49,
      "headline_text": "Above The Noise: Positive Signs For U.S. Economy And Markets",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:55.920661"
    },
    {
      "article_id": "1ec30fd4b1a4f9a9472c8ef905d1f501ecc70ef1",
      "url": "https://seekingalpha.com/article/4817001-big-move-coming-for-us-dollar-gold?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4817001-big-move-coming-for-us-dollar-gold",
      "source": "Seeking Alpha",
      "title": "Big Move Coming For The U.S. Dollar And Gold",
      "authors": null,
      "published_at": "2025-08-27T02:05:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2153051737/image_2153051737.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "The US Dollar Index is sitting at a critical juncture - currently testing a 14-year support trendline while also bumping up against a three-year resistance zone near $100. Read more here.",
      "text": "deepblue4you/iStock via Getty Images\n\ndeepblue4you/iStock via Getty Images\n\nThe US Dollar Index ( DXY ) is sitting at a critical junctureâ\u0080\u0094currently testing a 14-year support trendline (in green) while also bumping up against a three-year resistance zone near $100 (dashed red line). Where the dollar moves next could potentially\n\nThis article was written by",
      "word_count": 54,
      "headline_text": "Big Move Coming For The U.S. Dollar And Gold",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:56.847713"
    },
    {
      "article_id": "2e1a658da486baf5694da47e67a4ebd6aae1cb9e",
      "url": "https://seekingalpha.com/article/4816995-woolworths-group-limited-2025-q4-results-earnings-call-presentation?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816995-woolworths-group-limited-2025-q4-results-earnings-call-presentation",
      "source": "Seeking Alpha",
      "title": "Woolworths Group Limited 2025 Q4 - Results - Earnings Call Presentation (OTCMKTS:WOLWF)",
      "authors": null,
      "published_at": "2025-08-27T01:32:35-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "The following slide deck was published by Woolworths Group Limited in conjunction with their 2025 Q4 earnings call.",
      "text": "The following slide deck was published by Woolworths Group Limited in conjunction with their 2025 Q4 earnings call.\n\nThis article was written by",
      "word_count": 23,
      "headline_text": "Woolworths Group Limited 2025 Q4 - Results - Earnings Call Presentation",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:56.990939"
    },
    {
      "article_id": "4d042fbae470cd6f1a8606950b63589bbf1c0f1b",
      "url": "https://seekingalpha.com/article/4816996-park-national-further-margin-growth-will-support-earnings?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816996-park-national-further-margin-growth-will-support-earnings",
      "source": "Seeking Alpha",
      "title": "Park National Stock: Further Margin Growth Will Support Earnings (NYSE:PRK)",
      "authors": null,
      "published_at": "2025-08-27T02:33:54-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/112270374/image_112270374.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Park National's strong margin expansion and low loan growth will likely drive earnings this year. Read here for an analysis of PRK stock.",
      "text": "dosecreative/iStock via Getty Images\n\ndosecreative/iStock via Getty Images\n\nI upgraded Park National Corporation ( NYSE: PRK ) to a hold rating in my last report written in March. Since then, the stock price has rallied. Further, earnings have beaten my expectations because the net interest margin performed better\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 209,
      "headline_text": "Park National: Further Margin Growth Will Support Earnings",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.044330"
    },
    {
      "article_id": "e32739c36c786d19cab8cd939cd3d4d567996a68",
      "url": "https://seekingalpha.com/article/4817006-are-us-importers-ready-for-new-tariff-landscape?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4817006-are-us-importers-ready-for-new-tariff-landscape",
      "source": "Seeking Alpha",
      "title": "Are U.S. Importers Ready For The New Tariff Landscape?",
      "authors": null,
      "published_at": "2025-08-27T02:35:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2209634587/image_2209634587.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "The shifts in trade policies in 2025 raise questions about how businesses will be affected by potential increases in costs of imported goods.",
      "text": "Getty Images\n\nGetty Images\n\nBy Veronika Penciakova, Valerie Nguyen, Camelia Minoiu and Lauren Taylor\n\nThe shifts in trade policies in 2025 raise questions about how businesses will be affected by potential increases in costs of imported goods. This post provides a portrait\n\nThis article was written by",
      "word_count": 47,
      "headline_text": "Are U.S. Importers Ready For The New Tariff Landscape?",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.135378"
    },
    {
      "article_id": "f24f40af1ba7529eacf5e948007c7919bbb4975b",
      "url": "https://seekingalpha.com/article/4816988-thornburg-smallmid-cap-growth-fund-q2-2025-commentary?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816988-thornburg-smallmid-cap-growth-fund-q2-2025-commentary",
      "source": "Seeking Alpha",
      "title": "Thornburg Small/Mid Cap Growth Fund Q2 2025 Commentary",
      "authors": null,
      "published_at": "2025-08-27T02:25:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/185275162/image_185275162.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "In 2Q25 the portfolio (I share class) returned 14.38%, 307 basis points ahead of the Russell 2500 Growth Index. Read more here.",
      "text": "ranasu/E+ via Getty Images\n\nranasu/E+ via Getty Images\n\nRelative discounts versus large caps remain historically elevated, presenting compelling opportunities for long-term investors.\n\nSteven Klopukh, CFA, Portfolio Manager\n\nTim McCarthy, CFA, Portfolio Manager\n\nMarkets delivered strong returns in the second\n\nThis article was written by",
      "word_count": 44,
      "headline_text": "Thornburg Small/Mid Cap Growth Fund Q2 2025 Commentary",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.149940"
    },
    {
      "article_id": "d73ebdbd13cddb1f9aa0cc8d6ae30afa9bdbbc16",
      "url": "https://seekingalpha.com/article/4817003-commodities-oil-falls-indian-secondary-tariffs-come-into-effect?source=feed_all_articles",
      "canonical_url": "https://think.ing.com/articles/the-commodities-feed-oil-falls-as-indian-secondary-tariffs-come-into-effect270825/",
      "source": "Seeking Alpha",
      "title": "Commodities: Oil Falls As Indian Secondary Tariffs Come Into Effect",
      "authors": null,
      "published_at": "2025-08-27T02:30:00-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2158865428/image_2158865428.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "Oil prices came under pressure as US secondary tariffs on India come into effect, taking the total levy to 50%. Steel inventories at major Chinese steel mills rose for a 2nd consecutive week",
      "text": "Scharfsinn86/iStock via Getty Images\n\nScharfsinn86/iStock via Getty Images\n\nBy Warren Patterson , Ewa Manthey\n\nOil prices were unable to extend their 4-day run of gains, with ICE Brent coming under pressure yesterday to settle 2.3% lower. There was\n\nThis article was written by",
      "word_count": 43,
      "headline_text": "Commodities: Oil Falls As Indian Secondary Tariffs Come Into Effect",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.313976"
    },
    {
      "article_id": "c1edd755036336a4d63c56af3ebefc2837010693",
      "url": "https://www.bbc.com/news/articles/c5ykznn158qo?at_medium=RSS&at_campaign=rss",
      "canonical_url": "https://www.bbc.com/news/articles/c5ykznn158qo",
      "source": "feeds.bbci",
      "title": "Donald Trump's 50% tariff on India kicks in as PM Modi urges self-reliance",
      "authors": null,
      "published_at": null,
      "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/3e40/live/5f28ff50-81c8-11f0-b1b7-d5227004453f.jpg",
      "lang": "en-GB",
      "summary": "The US president's steep 50% tariffs on India have kicked in, sending Narendra Modi's government into firefighting mode.",
      "text": "Donald Trump's steep 50% tariffs on India have kicked in, weeks after the US president issued an executive order imposing an additional 25% penalty on India over its purchases of Russian oil and weapons.\n\nThis makes India - one of the US's strongest partners in the Indo-Pacific - among the countries paying the highest tariffs in the world. This could deal a blow to exports and growth in the world's fifth largest economy, given that the US was, until recently, India's largest trading partner.\n\nThe tariff setback has sent the Indian government into firefighting mode. Earlier this month, Indian Prime Minister Narendra Modi made a promise to cut taxes to mitigate their economic impact. He has also rallied for domestic self-reliance.\n\nHe said that a Diwali gift in the form of a \"massive tax bonanza\" was on its way for the common man and the millions of small businesses that power Asia's third largest economy.\n\nWearing a bright saffron turban and addressing crowds of spectators from the ramparts of Delhi's Red Fort during Independence Day celebrations, Modi also urged small shop owners and businesses to put up boards of \"Swadeshi\" or \"Made in India\" outside their stores.\n\n\"We should become self-reliant - not out of desperation, but out of pride,\" he said. \"Economic selfishness is on the rise globally and we mustn't sit and cry about our difficulties, we must rise above and not allow others to hold us in their clutches.\"\n\nHe has since repeated these comments in at least two other public addresses this week.\n\nFor many watching, this is clearly aimed at countering Donald Trump's brutal 50% tariff rate on India which will disrupt millions of livelihoods across the country's export-driven industries that supply everything from clothes to diamonds and shrimp to American consumers.\n\nAmid the blow, Modi's message to his countrymen has been loud and clear - both make in India and spend in India.\n\nThe former has proved increasingly difficult, with the share of manufacturing as part of India's gross domestic product (GDP) stagnating at 15% levels, despite his government rolling out subsidies and production incentives over the years.\n\nBut spurring long-pending tax reforms that immediately put more money into the hands of people could help the government soften some of the blow, experts say.\n\nAnd so, after a $12bn income tax giveaway announced in the budget earlier this year, Modi is now aiming for an overhaul of India's indirect tax architecture – a reduction and simplification of the goods & service tax (GST).\n\nGST, which was introduced eight years ago, replaced a maze of indirect taxes to reduce compliance and the cost of doing business.\n\nBut experts say it has too many thresholds and exemptions, making the system extremely complicated. They've repeatedly called for it to be revamped.\n\nNow, Modi has promised precisely that, with India's finance ministry putting out a proposal for a simplified two-tier GST system.\n\n\"Combined with the income tax cut in place from April 2025... the GST rate reforms [likely worth US$20bn; £14.7bn] should together provide a meaningful push to consumption,\" analysts from Jeffries, a US brokerage house, said after the announcement.\n\nPrivate consumption is a mainstay of India's economy, contributing to nearly 60% of the country's GDP. While rural spending – supported by a bumper harvest – has remained strong, demand for goods and services in cities has continued to slow down due to lower wages and job cuts in major sectors like IT, post the pandemic.\n\nModi's \"fiscal stimulus\" or tax cuts should help ensure a consumption recovery, according to investment banking firm Morgan Stanley. It will push GDP up and drag inflation down.\n\n\"This is particularly crucial amid headwinds from ongoing global geopolitical tensions and adverse global tariff-related developments that might impair external demand,\" Morgan Stanley said.\n\nAmong the sectors most likely to benefit from the tax breaks are consumer-facing ones such as, scooters, small cars, garments and even things like cement that goes into making homes, where demand typically picks up pace around Diwali.\n\nWhile the specifics are unknown, most analysts estimate that the revenue loss on account of a lower GST would be offset by surplus levy collections and higher than budgeted dividends from India's central bank.\n\nAccording to Swiss investment bank UBS, the GST cuts will also have a larger \"multiplier effect\" than the previous corporate and income tax cuts undertaken by Modi, as they \"directly affect consumption at the point of purchase, potentially leading to higher consumer spending\".\n\nModi's tax handouts could also increase the probability of a further interest rate reduction by India's central bank, which has already slashed rates by 1% in the past few months - something that is likely to spur more lending, according to analysts.\n\nThis, along with a boost in the salaries of nearly five million government employees and 6.8 million pensioners that kicks in early next year, will help India's economy retain its growth momentum, they say.\n\nIndia's stock markets have cheered these announcements. And despite the panic caused by trade uncertainties, earlier this month, India also got a rare sovereign rating upgrade from S&P Global, after a gap of 18 years. A sovereign rating measures how risky it is to lend to a government or invest in a country.\n\nThis is significant because it could lower the government's borrowing costs and improve foreign investment flows into the country.\n\nBut even as Modi rushes through with long-delayed reforms, India's growth prospects have slowed significantly from the 8% levels seen a few years ago, and its external crisis shows no sign of ebbing.\n\nThe war of words between Delhi and Washington, especially over the latter's energy purchases from Russia, have only intensified and trade negotiations which were set to begin earlier this week, have been called off.\n\nMeanwhile, at 50%, the tariffs on India are akin to a sanction on trade between the world's biggest and fastest growing economies, say experts - a scenario that would have been unthinkable even just a few months ago.\n\nFollow BBC News India on Instagram , YouTube, X and Facebook .",
      "word_count": 1010,
      "headline_text": "Trump's 50% tariff on India kicks in as Modi urges self-reliance",
      "category": "general_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.621662"
    },
    {
      "article_id": "88141f9a9186ab8cb81d10239a4b3b84f28237a1",
      "url": "https://seekingalpha.com/article/4816982-eqt-olympus-acquisition-and-data-center-boom-key-for-secular-growth?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816982-eqt-olympus-acquisition-and-data-center-boom-key-for-secular-growth",
      "source": "Seeking Alpha",
      "title": "EQT: Olympus Acquisition And Data Center Boom Key For Secular Growth (NYSE:EQT)",
      "authors": null,
      "published_at": "2025-08-27T01:17:19-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/2174681199/image_2174681199.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "EQT's Olympus Energy acquisition boosts FCF yield to 15%, adds $530M in EBITDA, and drives LNG growth. See why it's a top long-term investment.",
      "text": "Getty Images\n\nGetty Images\n\nEQT Corporation ( NYSE: EQT ) is a prominent natural gas company in America, operating on a midstream and vertically integrated model. In operation for more than a century and located in the pivotal Appalachian region, the company emerged as\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 205,
      "headline_text": "EQT: Olympus Acquisition And Data Center Boom Key For Secular Growth",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.943347"
    },
    {
      "article_id": "e32abb3e5c5dbf746ced5b9ac0b77c8482e2357c",
      "url": "https://seekingalpha.com/article/4816993-woolworths-group-limited-wolwf-q4-2025-earnings-call-transcript?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816993-woolworths-group-limited-wolwf-q4-2025-earnings-call-transcript",
      "source": "Seeking Alpha",
      "title": "Woolworths Group Limited (WOLWF) Q4 2025 Earnings Call Transcript",
      "authors": null,
      "published_at": "2025-08-27T01:30:40-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "Woolworths Group Limited (OTCPK:WOLWF) Q4 2025 Earnings Conference Call August 26, 2025 8:30 PM ETCompany ParticipantsAmanda Bardwell - CEO, Director &amp;...",
      "text": "Woolworths Group Limited ( OTCPK:WOLWF ) Q4 2025 Earnings Conference Call August 26, 2025 8:30 PM ET\n\nCompany Participants\n\nAmanda Bardwell - CEO, Director & MD Annette Karantoni - Managing Director of Woolworths Retail Stephen Harrison - Chief Financial Officer\n\nConference Call Participants\n\nAdrian Lemme - Citigroup Inc., Research Division Ben Gilbert - Jarden Limited, Research Division Bryan Raymond - JPMorgan Chase & Co, Research Division Craig John Woolford - MST Financial Services Pty Limited, Research Division David Errington - BofA Securities, Research Division Michael Simotas - Jefferies LLC, Research Division Nicole Penny - Rimor Equity Research Phillip Kimber - E&P, Research Division Richard Barwick - CLSA Limited, Research Division Shaun Robert Cousins - UBS Investment Bank, Research Division Thomas Kierath - Barrenjoey Markets Pty Limited, Research Division\n\nOperator\n\nThank you for standing by, and welcome to Woolworths Group FY '25 Full Year Earnings Announcement. [Operator Instructions]\n\nI would now like to hand the conference over to Ms. Amanda Bardwell, Managing Director and CEO of Woolworths Group. Please go ahead.\n\nAmanda Bardwell\n\nGood morning, everyone. Thank you for joining us today for Woolworths Group's full year results for the 2025 financial year. I would like to start by acknowledging the traditional custodians of the land on which we meet today, Darug Country, and I'd like to pay my respects to Elders past and present.\n\nJoining me this morning are Stephen Harrison, our Chief Financial Officer; Annette Karantoni, Managing Director of Woolworths Retail; Sally Copeland, Managing Director of Woolworths New Zealand, and former Managing Director of Group eComX; and Dan Hake, Managing Director of BIG W.\n\nI will start with an overview of the group's performance in F '25 and an update on our focus areas as announced in February. Steve will then cover off our financial performance before I conclude with an update on",
      "word_count": 304,
      "headline_text": "Woolworths Group Limited (WOLWF) Q4 2025 Earnings Call Transcript",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.944677"
    },
    {
      "article_id": "daf2b451121f3c48c0e2613c0a19c2fc5d0e68f2",
      "url": "https://seekingalpha.com/article/4816977-ooma-inc-ooma-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816977-ooma-inc-ooma-q2-2026-earnings-call-transcript",
      "source": "Seeking Alpha",
      "title": "Ooma, Inc. (OOMA) Q2 2026 Earnings Call Transcript",
      "authors": null,
      "published_at": "2025-08-26T23:59:56-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "Ooma, Inc. (NYSE:OOMA) Q2 2026 Earnings Conference Call August 26, 2025 5:00 PM ETCompany ParticipantsEric B.",
      "text": "Ooma, Inc. ( NYSE: OOMA ) Q2 2026 Earnings Conference Call August 26, 2025 5:00 PM ET\n\nCompany Participants\n\nEric B. Stang - President, CEO & Chairman Matthew Sewell Robison - Director of IR & Corporate Development Shigeyuki Hamamatsu - Senior VP & CFO\n\nConference Call Participants\n\nAlinda Li - William Blair & Company L.L.C., Research Division Eric Martinuzzi - Lake Street Capital Markets, LLC, Research Division Kincaid LaCorte - Unidentified Company Matthew Joseph Harrigan - The Benchmark Company, LLC, Research Division Michael Joshua Nichols - B. Riley Securities, Inc., Research Division\n\nOperator\n\nHello, and welcome to Ooma, Inc. Second Quarter Fiscal Year 2026 Financial Results Conference Call. [Operator Instructions] I would now like to turn the conference over to Matt. You may begin.\n\nMatthew Sewell Robison\n\nThank you, Towanda. Good day, everyone, and welcome to the Fiscal Second Quarter 2026 Earnings Call of Ooma, Inc. My name is Matt Robison, Ooma's Director of IR and Corporate Development. On the call with me today are Ooma's CEO, Eric Stang; and CFO, Shig Hamamatsu.\n\nAfter the market closed today, Ooma issued its fiscal second quarter 2026 earnings press release. This release is also available on the company's website, ooma.com. This call is being webcast live and is accessible from a link on the Events and Presentations page of the Investor Relations section of our website. This link will be active for replay of this call for 1 year.\n\nDuring today's presentation, our executives will make forward-looking statements within the meaning of the federal securities laws. Forward-looking statements generally relate to future events or future financial or operating performance. Our expectations and beliefs regarding these matters may not materialize, and actual results are subject to risks and uncertainties that could cause actual results to differ materially from those projected. These risks include those set forth in the press release we",
      "word_count": 308,
      "headline_text": "Ooma, Inc. (OOMA) Q2 2026 Earnings Call Transcript",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:57.995869"
    },
    {
      "article_id": "c7a54be91f85ceaf91d17b35bafe11c1b0df3d57",
      "url": "https://seekingalpha.com/article/4816966-ihy-this-bond-etf-qualifies-buy-barely?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816966-ihy-this-bond-etf-qualifies-buy-barely",
      "source": "Seeking Alpha",
      "title": "IHY: This Bond ETF Qualifies As A Buy, Barely (NYSEARCA:IHY)",
      "authors": null,
      "published_at": "2025-08-27T00:15:56-04:00",
      "top_image": "https://static.seekingalpha.com/cdn/s3/uploads/getty_images/1474741936/image_1474741936.jpg?io=getty-c-w1536",
      "lang": "en",
      "summary": "VanEck International High Yield Bond ETF earns a Buy rating with strong historical returns, higher yield, and diversification benefits. See more on IHY ETF here.",
      "text": "tumsasedgars/iStock via Getty Images\n\nIt has been a while since my last post because I wanted to develop an appropriate algorithm for rating bond ETFs. I think I found one, and I want to see how it works for reviewing The VanEck International High Yield\n\nThis article was written by\n\nAnalystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "word_count": 206,
      "headline_text": "IHY: This Bond ETF Qualifies As A Buy, Barely",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:58.156631"
    },
    {
      "article_id": "66c3a5acfdf5bab7ebc35183ab924e150d28ea96",
      "url": "https://seekingalpha.com/article/4816978-ooma-inc-2026-q2-results-earnings-call-presentation?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816978-ooma-inc-2026-q2-results-earnings-call-presentation",
      "source": "Seeking Alpha",
      "title": "Ooma, Inc. 2026 Q2 - Results - Earnings Call Presentation (NYSE:OOMA)",
      "authors": null,
      "published_at": "2025-08-27T00:02:20-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "The following slide deck was published by Ooma, Inc.",
      "text": "The following slide deck was published by Ooma, Inc. in conjunction with their 2026 Q2 earnings call.\n\nThis article was written by",
      "word_count": 22,
      "headline_text": "Ooma, Inc. 2026 Q2 - Results - Earnings Call Presentation",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:58.236441"
    },
    {
      "article_id": "090832ca34cf0bf9e0cdb01ac167fd2825305dfe",
      "url": "https://seekingalpha.com/article/4802983-politics-and-the-markets-082725?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4802983-politics-and-the-markets-082725",
      "source": "Seeking Alpha",
      "title": "Politics And The Markets 08/27/25",
      "authors": null,
      "published_at": "2025-08-27T00:00:00-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "This is the forum for daily political discussion on Seeking Alpha. A new version is published every market day. Please don't leave political comments on other articles or posts on the site",
      "text": "9This is the forum for daily political discussion on Seeking Alpha. A new version is published every market day.\n\nPlease don't leave political comments on other articles or posts on the site.\n\nThe comments below are not regulated with the same rigor as the rest of the site, and this is an 'enter at your own risk' area as discussion can get very heated. If you can't stand the heat... you know what they say...\n\nMore on Today's Markets:\n\nModeration Guidelines:\n\nWe remove comments under the following categories:\n\nRegardless of which side of the political divide you find yourself, please be courteous and don't direct abuse at other users.\n\nFor any issue with regards to comments please email us at : moderation@seekingalpha.com.\n\nSeeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.\n\nThis article was written by",
      "word_count": 215,
      "headline_text": "Politics And The Markets 08/27/25",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:58.271706"
    },
    {
      "article_id": "2ab3202c310c99e91ea419d66a18d57422829b0c",
      "url": "https://www.marketwatch.com/story/echostars-stock-is-surging-why-at-t-just-struck-a-23-billion-spectrum-deal-with-the-company-6ac87d75?mod=mw_rss_topstories",
      "canonical_url": null,
      "source": "feeds.marketwatch",
      "title": "EchoStar’s stock is surging. Why AT&T just struck a $23 billion spectrum deal with the company.",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "EchoStar’s stock is surging. Why AT&T just struck a $23 billion spectrum deal with the company.",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 401,
      "error": "http_401",
      "scraped_at": "2025-08-26T23:48:58.345296"
    },
    {
      "article_id": "02e1ff140eca95d8905dd8d3f01ac7c0fae858b3",
      "url": "https://www.investing.com/news/cryptocurrency-news/bitcoin-price-today-hits-7wk-low-near-110k-amid-fed-independence-worries-4210104",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "Bitcoin price today: dips to 7-wk low near $110k amid Fed independence worries",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Bitcoin price today: dips to 7-wk low near $110k amid Fed independence worries",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-26T23:48:58.461595"
    },
    {
      "article_id": "bf1d88e6c2ca8c0fb3f4178d3fb6d853d0f90417",
      "url": "https://seekingalpha.com/article/4816975-okta-inc-2026-q2-results-earnings-call-presentation?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816975-okta-inc-2026-q2-results-earnings-call-presentation",
      "source": "Seeking Alpha",
      "title": "Okta, Inc. 2026 Q2 - Results - Earnings Call Presentation (NASDAQ:OKTA)",
      "authors": null,
      "published_at": "2025-08-26T23:57:07-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "The following slide deck was published by Okta, Inc.",
      "text": "The following slide deck was published by Okta, Inc. in conjunction with their 2026 Q2 earnings call.\n\nThis article was written by",
      "word_count": 22,
      "headline_text": "Okta, Inc. 2026 Q2 - Results - Earnings Call Presentation",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:58.981172"
    },
    {
      "article_id": "f6cbbd1402e504898c0a95dada38cfe006e18dff",
      "url": "https://www.marketwatch.com/story/amds-stock-is-rising-as-the-competitive-battle-with-nvidia-hits-a-new-dimension-16fe37ef?mod=mw_rss_topstories",
      "canonical_url": null,
      "source": "feeds.marketwatch",
      "title": "AMD’s stock is rising as the competitive battle with Nvidia enters a new dimension",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "AMD’s stock is rising as the competitive battle with Nvidia enters a new dimension",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 401,
      "error": "http_401",
      "scraped_at": "2025-08-26T23:48:59.183770"
    },
    {
      "article_id": "6b35e666540b45dba153c57180f648aad4c325ba",
      "url": "https://seekingalpha.com/article/4816974-okta-inc-okta-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "canonical_url": "https://seekingalpha.com/article/4816974-okta-inc-okta-q2-2026-earnings-call-transcript",
      "source": "Seeking Alpha",
      "title": "Okta, Inc. (OKTA) Q2 2026 Earnings Call Transcript",
      "authors": null,
      "published_at": "2025-08-26T23:55:32-04:00",
      "top_image": "https://static.seekingalpha.com/assets/og_image_1200-29b2bfe1a595477db6826bd2126c63ac2091efb7ec76347a8e7f81ba17e3de6c.png",
      "lang": "en",
      "summary": "Okta, Inc. (NASDAQ:OKTA) Q2 2026 Earnings Conference Call August 26, 2025 5:00 PM ETCompany ParticipantsBrett Tighe - Chief Financial OfficerDave Gennarelli...",
      "text": "Okta, Inc. ( NASDAQ: OKTA ) Q2 2026 Earnings Conference Call August 26, 2025 5:00 PM ET\n\nCompany Participants\n\nBrett Tighe - Chief Financial Officer Dave Gennarelli - Senior Vice President of Investor Relations Eric Kelleher - President & COO Todd McKinnon - Co-Founder, Chairman & CEO\n\nConference Call Participants\n\nAdam Charles Borg - Stifel, Nicolaus & Company, Incorporated, Research Division Andrew James Nowinski - Wells Fargo Securities, LLC, Research Division Annick Jana Baumann - Jefferies LLC, Research Division Brad Alan Zelnick - Deutsche Bank AG, Research Division Brian Lee Essex - JPMorgan Chase & Co, Research Division Eric Michael Heath - KeyBanc Capital Markets Inc., Research Division Gabriela Borges - Goldman Sachs Group, Inc., Research Division Gregg Steven Moskowitz - Mizuho Securities USA LLC, Research Division John Stephen DiFucci - Guggenheim Securities, LLC, Research Division Jonathan Blake Ruykhaver - Cantor Fitzgerald & Co., Research Division Joshua Alexander Tilton - Wolfe Research, LLC Matthew George Hedberg - RBC Capital Markets, Research Division Michael Joseph Cikos - Needham & Company, LLC, Research Division Robbie David Owens - Piper Sandler & Co., Research Division Shrenik Kothari - Robert W. Baird & Co. Incorporated, Research Division\n\nDave Gennarelli\n\nHi, everyone. Welcome to Okta Second Quarter Fiscal 2026 Earnings Webcast. I'm Dave Gennarelli, Senior Vice President of Investor Relations at Okta. Presenting in today's meeting will be Todd McKinnon, our Chief Executive Officer and Co-Founder; and Brett Tighe, our Chief Financial Officer. Eric Kelleher, our President and Chief Operating Officer, will join the Q&A portion of the meeting.\n\nAt around the same time that the earnings press release hit the wire, we posted supplemental commentary to the IR website. Today's meeting will include forward-looking statements pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995, including, but not limited to, statements regarding our financial outlook and market",
      "word_count": 308,
      "headline_text": "Okta, Inc. (OKTA) Q2 2026 Earnings Call Transcript",
      "category": "financial_news",
      "scrape_status": "ok",
      "http_status": 200,
      "scraped_at": "2025-08-26T23:48:59.241916"
    },
    {
      "article_id": "003d9864d070ec35e802e4a015be0343db8b6c59",
      "url": "https://www.marketwatch.com/story/tommy-hilfiger-parent-says-it-still-expects-2025-to-be-a-comeback-year-even-as-tariffs-upend-clothing-industry-c50d7793?mod=mw_rss_topstories",
      "canonical_url": null,
      "source": "feeds.marketwatch",
      "title": "Tommy Hilfiger parent says it still expects 2025 to be a comeback year, even as tariffs upend clothing industry",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Tommy Hilfiger parent says it still expects 2025 to be a comeback year, even as tariffs upend clothing industry",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 401,
      "error": "http_401",
      "scraped_at": "2025-08-26T23:48:59.337250"
    },
    {
      "article_id": "d146b922cde34fb5217d4e4c4253e01e83a3340b",
      "url": "https://www.marketwatch.com/story/cracker-barrel-dumps-new-logo-after-backlash-and-its-stock-rallies-710c5ed8?mod=mw_rss_topstories",
      "canonical_url": null,
      "source": "feeds.marketwatch",
      "title": "Cracker Barrel dumps new logo after backlash, and its stock rallies",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "Cracker Barrel dumps new logo after backlash, and its stock rallies",
      "category": "financial_news",
      "scrape_status": "error",
      "http_status": 401,
      "error": "http_401",
      "scraped_at": "2025-08-26T23:48:59.390638"
    },
    {
      "article_id": "fc1e4403bdb56122da0fd58bfeb37e6c24994b97",
      "url": "https://www.investing.com/news/cryptocurrency-news/tao-synergies-appoints-joseph-jacks-as-advisor-for-treasury-strategy-432SI-4211019",
      "canonical_url": null,
      "source": "Investing.com",
      "title": "TAO Synergies appoints Joseph Jacks as advisor for treasury strategy",
      "authors": null,
      "published_at": null,
      "top_image": null,
      "lang": null,
      "summary": null,
      "text": null,
      "word_count": null,
      "headline_text": "TAO Synergies appoints Joseph Jacks as advisor for treasury strategy",
      "category": "market_specific",
      "scrape_status": "error",
      "http_status": 403,
      "error": "http_403",
      "scraped_at": "2025-08-26T23:48:59.552010"
    }
  ],
  "total_articles": 22,
  "collected_at": "2025-08-26T23:48:59.555342"
}