{
  "date": "20250904",
  "data_type": "articles_clean",
  "saved_at": "2025-09-07T10:52:46.208409",
  "articles": [
    {
      "link": "https://seekingalpha.com/article/4819508-great-west-lifeco-inc-gwo-ca-presents-at-2025-scotiabank-financials-summit-transcript?source=feed_all_articles",
      "title": "Great-West Lifeco Inc. (GWO:CA) Presents at 2025 Scotiabank Financials Summit (Transcript)",
      "clean_text": "Great-West Lifeco Inc. ( TSX: GWO:CA ) 2025 Scotiabank Financials Summit September 4, 2025 9:00 AM EDT Company Participants David Harney - President, CEO & Director Conference Call Participants Mehmed Rizvanovic - Scotiabank Global Banking and Markets, Research Division Presentation Mehmed Rizvanovic MD & Insurance Analyst And with that, I'll introduce our next guest, David Harney, President and Chief Executive Officer of Great-West. David? David Harney President, CEO & Director Good morning, Mike. Mehmed Rizvanovic MD & Insurance Analyst Thanks for joining us. Pleasure to have you. David Harney President, CEO & Director Yes. Pleasure to be here. Question-and-Answer Session Mehmed Rizvanovic Scotiabank Global Banking and Markets, Research Division So first order of business, obviously, a big congrats on your appointment. You've been with the company for a while, with Irish Life for a while. Maybe just talk a little bit about some of your near-term priorities, just to remind investors what you're focused on for Great-West? David Harney President, CEO & Director Yes. So maybe just a brief introduction. Many people in the room won't know me. So yes, I'm in the role now since 1st of July. I became part of the Great-West Group in 2013 when Great-West bought Irish Life. That was during the global financial crisis. It was a great acquisition for Great-West, but a fantastic acquisition for Irish Life as well, and they've prospered within the group since that acquisition. I ran Irish Life from 2016 to 2020, ran the European business then for the last 5 years and more recently oversaw the Reinsurance business and I'm in this role now since 1st of July. So I feel very lucky like I'm inheriting and coming into a portfolio that's in fantastic shape. We talk about our geographies, our markets and then our positions. So we believe we're in the right geographies at the",
      "excerpt": "Great-West Lifeco Inc. ( TSX: GWO:CA ) 2025 Scotiabank Financials Summit September 4, 2025 9:00 AM EDT Company Participants David Harney - President, CEO & Director Conference Call Participants Mehmed Rizvanovic - Scotiabank Global Banking and Markets, Research Division Presentation Mehmed Rizvanovic MD & Insurance Analyst And with that, I'll introduce our next guest, David Harney, President and Chief Executive Officer of Great-West. David? David Harney President, CEO & Director Good morning, Mike. Mehmed Rizvanovic MD & Insurance Analyst Thanks for joining us. Pleasure to have you. David Harney President, CEO & Director Yes. Pleasure to be here. Question-and-Answer Session Mehmed Rizvanovic Scotiabank Global Banking and Markets, Research Division So first order of business, obviously, a big congrats on your appointment.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819509-genesco-inc-gco-presents-at-goldman-sachs-32nd-annual-global-retailing-conference-2025?source=feed_all_articles",
      "title": "Genesco Inc. (GCO) Presents at Goldman Sachs 32nd Annual Global Retailing Conference",
      "clean_text": "Genesco Inc. ( NYSE: GCO ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 4, 2025 8:55 AM EDT Company Participants Mimi Vaughn - Chairman, President & CEO Cassandra Harris - Senior VP of Finance, CFO & Principal Accounting Officer Conference Call Participants Brooke Roche Presentation Brooke Roche Good morning, and welcome to day 2 of our 32nd Annual Global Retailing Conference here at GS. My name is Brooke Roche, and I cover the apparel, softlines and brand sector here at Goldman. And I'm very pleased to introduce our next session with Genesco. Here with me today are Mimi Vaughn, Board Chair, President and CEO; and Sandra Harris, CFO. Welcome, Mimi. Welcome, Sandra. Mimi Vaughn Chairman, President & CEO Thank you, Brooke. Great to be here with you. Brooke Roche Shall we run the opening video? Mimi Vaughn Chairman, President & CEO Yes. Let's run it. [Presentation] Brooke Roche Great. Well, that showed some really interesting things, including your new store format. But maybe to kick it off, you've implemented a lot of changes to the business over the last few years. And some of those strategic shifts have really started to gain traction. Can you briefly discuss the most important changes and the impact that you expect them to have this year? Question-and-Answer Session Mimi Vaughn Chairman, President & CEO Sure, sure. It's a great question. And for those of you who don't know our brands, we have a branded side of our business and also a retail side of our business. Our brands, we both own brands and we license brands through Johnston & Murphy and through Genesco Brands Group. And then we have a terrific retail business that sells all the hottest brands to really young people. We have strategically well-positioned businesses. We're coming off of a great 4-quarter run with",
      "excerpt": "Genesco Inc. ( NYSE: GCO ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 4, 2025 8:55 AM EDT Company Participants Mimi Vaughn - Chairman, President & CEO Cassandra Harris - Senior VP of Finance, CFO & Principal Accounting Officer Conference Call Participants Brooke Roche Presentation Brooke Roche Good morning, and welcome to day 2 of our 32nd Annual Global Retailing Conference here at GS. My name is Brooke Roche, and I cover the apparel, softlines and brand sector here at Goldman. And I'm very pleased to introduce our next session with Genesco. Here with me today are Mimi Vaughn, Board Chair, President and CEO; and Sandra Harris, CFO. Welcome, Mimi. Welcome, Sandra. Mimi Vaughn Chairman, President & CEO Thank you, Brooke. Great to be here with you. Brooke Roche Shall we run the opening video? Mimi Vaughn Chairman, President & CEO Yes. Let's run it.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819529-versabank-vbnk-ca-q3-2025-earnings-call-transcript?source=feed_all_articles",
      "title": "VersaBank (VBNK:CA) Q3 2025 Earnings Call Transcript",
      "clean_text": "VersaBank ( TSX: VBNK:CA ) Q3 2025 Earnings Call September 4, 2025 9:00 AM EDT Company Participants David Taylor - President & Director John Asma - Chief Financial Officer Conference Call Participants Joseph Yanchunis - Raymond James & Associates, Inc., Research Division Timothy Switzer - Keefe, Bruyette, & Woods, Inc., Research Division Andrew Scutt - ROTH Capital Partners, LLC, Research Division Presentation Operator Good morning, ladies and gentlemen, and welcome to VersaBank's Third Quarter Fiscal 2025 Financial Results Conference Call. Earlier today, VersaBank issued a news release reporting its financial results for the third quarter ended July 31, 2025. That news release, along with VersaBank's financial statements and MD&A are available on VersaBank's website in the Investor Relations section. Please note, VersaBank is webcasting this conference call live over the Internet. The webcast is listen only. [Operator Instructions] Please dial into the conference lines, the details of which are included on the current slide of the presentation as well as in the morning's news release and on VersaBank's website. For those participating in today's call by telephone, the accompanying slide presentation is available as a stand-alone file on VersaBank's website. Please note that today's call is being archived for replay both by telephone and via the Internet beginning approximately 1 hour following completion of the call. Details on how to access the replays are available in this morning's news release. I would like to remind our listeners that the statements about future events made on this call are forward-looking in nature and are based on certain assumptions and analysis made by VersaBank management. Actual results could differ materially from our expectations due to various material risks and uncertainties associated with VersaBank's businesses. Please refer to VersaBank's forward-looking statement advisory in today's presentation. And now I would like to turn the call over to David",
      "excerpt": "VersaBank ( TSX: VBNK:CA ) Q3 2025 Earnings Call September 4, 2025 9:00 AM EDT Company Participants David Taylor - President & Director John Asma - Chief Financial Officer Conference Call Participants Joseph Yanchunis - Raymond James & Associates, Inc., Research Division Timothy Switzer - Keefe, Bruyette, & Woods, Inc., Research Division Andrew Scutt - ROTH Capital Partners, LLC, Research Division Presentation Operator Good morning, ladies and gentlemen, and welcome to VersaBank's Third Quarter Fiscal 2025 Financial Results Conference Call. Earlier today, VersaBank issued a news release reporting its financial results for the third quarter ended July 31, 2025. That news release, along with VersaBank's financial statements and MD&A are available on VersaBank's website in the Investor Relations section. Please note, VersaBank is webcasting this conference call live over the Internet.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819570-c3ai-looking-like-a-victim-of-ai-with-negative-growth-and-non-gaap-operating-losses?source=feed_all_articles",
      "title": "C3.ai: A Victim Of AI With Negative Growth, Non-GAAP Operating Losses (NYSE:AI)",
      "clean_text": "J Studios/DigitalVision via Getty Images C3.ai, Inc. ( AI), falling on Thursday after releasing first quarter results that were more or less in line with the preliminary release from last month. The company has seen a sudden reversal in its growth trajectory, with management blaming bad execution. The After a historic valuation reset, the growth investing landscape has changed. Get my best research at your fingertips today. Get access to Best of Breed Growth Stocks: This article was written by Julian Lin is a financial analyst. He finds undervalued companies with secular growth that appreciate over time. His approach is to look for companies with strong balance sheets and management teams in sectors with long growth runways. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of ADBE either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "J Studios/DigitalVision via Getty Images C3.ai, Inc. ( AI), falling on Thursday after releasing first quarter results that were more or less in line with the preliminary release from last month. The company has seen a sudden reversal in its growth trajectory, with management blaming bad execution. The After a historic valuation reset, the growth investing landscape has changed. Get my best research at your fingertips today. Get access to Best of Breed Growth Stocks: This article was written by Julian Lin is a financial analyst. He finds undervalued companies with secular growth that appreciate over time. His approach is to look for companies with strong balance sheets and management teams in sectors with long growth runways. Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of ADBE either through stock ownership, options, or other derivatives.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819539-the-fed-is-a-soap-opera?source=feed_all_articles",
      "title": "The Fed Is A Soap Operaâ\u0080¦",
      "clean_text": "Pgiam/iStock via Getty Images Manole Capital Management The Federal Reserve September 2025 Who would have thought the Federal Reserve could rival a soap opera for drama? Chairman Powell, first appointed in 2018, has already faced a This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of CME either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Pgiam/iStock via Getty Images Manole Capital Management The Federal Reserve September 2025 Who would have thought the Federal Reserve could rival a soap opera for drama? Chairman Powell, first appointed in 2018, has already faced a This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of CME either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819585-versabank-2025-q3-results-earnings-call-presentation?source=feed_all_articles",
      "title": "VersaBank 2025 Q3 - Results - Earnings Call Presentation (TSX:VBNK:CA)",
      "clean_text": "The following slide deck was published by VersaBank in conjunction with their 2025 Q3 earnings call. This article was written by",
      "excerpt": "The following slide deck was published by VersaBank in conjunction with their 2025 Q3 earnings call. This article was written by",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819583-duluth-holdings-inc-2025-q2-results-earnings-call-presentation?source=feed_all_articles",
      "title": "Duluth Holdings Inc. 2025 Q2 - Results - Earnings Call Presentation (NASDAQ:DLTH)",
      "clean_text": "The following slide deck was published by Duluth Holdings Inc. in conjunction with their 2025 Q2 earnings call. This article was written by",
      "excerpt": "The following slide deck was published by Duluth Holdings Inc. in conjunction with their 2025 Q2 earnings call. This article was written by",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819532-anglogold-ashanti-another-solid-quarter-poised-to-keep-outperforming?source=feed_all_articles",
      "title": "AngloGold Ashanti: Another Solid Quarter, Poised To Keep Outperforming (NYSE:AU)",
      "clean_text": "Bet_Noire/iStock via Getty Images Since my last coverage , AngloGold ( NYSE: AU ), is up more than 50%, demonstrating the company great momentum after a record year in which the company yielded a strong revenue growth, record free cash flow of almost $1B, and This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Bet_Noire/iStock via Getty Images Since my last coverage , AngloGold ( NYSE: AU ), is up more than 50%, demonstrating the company great momentum after a record year in which the company yielded a strong revenue growth, record free cash flow of almost $1B, and This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819566-relatively-loose-macro-conditions-tailwind-stocks?source=feed_all_articles",
      "title": "Relatively Loose Macro Conditions Remain A Tailwind For Stocks",
      "clean_text": "Marcus Millo/iStock via Getty Images By James Picerno Identifying why the stock market trends one way or the other is a slippery affair, especially in the short term, but a broad measure of macro â\u0080\u009cliquidityâ\u0080\u009d 1 conditions is usually This article was written by",
      "excerpt": "Marcus Millo/iStock via Getty Images By James Picerno Identifying why the stock market trends one way or the other is a slippery affair, especially in the short term, but a broad measure of macro â\u0080\u009cliquidityâ\u0080\u009d 1 conditions is usually This article was written by",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819499-ulta-beauty-inc-ulta-presents-at-goldman-sachs-32nd-annual-global-retailing-conference-2025?source=feed_all_articles",
      "title": "Ulta Beauty, Inc. (ULTA) Presents at Goldman Sachs 32nd Annual Global Retailing Conference",
      "clean_text": "Ulta Beauty, Inc. ( NASDAQ: ULTA ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 4, 2025 8:55 AM EDT Company Participants Kecia Steelman - President, CEO & Director Chris Lialios - Senior VP, Interim CFO & Controller Conference Call Participants Katharine McShane - Goldman Sachs Group, Inc., Research Division Presentation Katharine McShane MD & Retail Analyst Okay. Good morning, everyone. It's my pleasure to introduce Ulta Beauty and to moderate this fireside chat. Today, we have with us Kecia Steelman, President and Chief Executive Officer of Ulta. She's been in the role since January 2025 and previously served in a number of leadership roles since joining the company in July 2014. And we also have with us Chris Lialios, Interim Chief Financial Officer of Ulta as of June '25, previously serving as Senior Vice President and Controller since 2018. Thank you for joining us today. Kecia Steelman President, CEO & Director Yes, thank you, Kate, for having us. Question-and-Answer Session Katharine McShane Goldman Sachs Group, Inc., Research Division It's -- both of you guys are first timers to the conference. So we're very excited to have you. Kecia, if we can maybe start with you. You've been in the CEO seat for about 8 months now. You've done a lot of work. What have been some of the bigger challenges you faced in that time? And what have been some of the bigger accomplishments so far? Kecia Steelman President, CEO & Director Yes. Thank you so much for the question. I will say it's been a fun 8 months, that's for sure. And it's been fast and furious. I'd say my biggest focus has been really reaccelerating our performance overall and really leaning into our competitive opportunities for us to continue to drive our business. A couple of things I would just",
      "excerpt": "Ulta Beauty, Inc. ( NASDAQ: ULTA ) Goldman Sachs 32nd Annual Global Retailing Conference 2025 September 4, 2025 8:55 AM EDT Company Participants Kecia Steelman - President, CEO & Director Chris Lialios - Senior VP, Interim CFO & Controller Conference Call Participants Katharine McShane - Goldman Sachs Group, Inc., Research Division Presentation Katharine McShane MD & Retail Analyst Okay. Good morning, everyone. It's my pleasure to introduce Ulta Beauty and to moderate this fireside chat. Today, we have with us Kecia Steelman, President and Chief Executive Officer of Ulta. She's been in the role since January 2025 and previously served in a number of leadership roles since joining the company in July 2014. And we also have with us Chris Lialios, Interim Chief Financial Officer of Ulta as of June '25, previously serving as Senior Vice President and Controller since 2018.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819531-cimpress-navigates-product-transition-amid-economic-headwinds?source=feed_all_articles",
      "title": "Cimpress Navigates Product Transition Amid Economic Headwinds (NASDAQ:CMPR)",
      "clean_text": "Itsanan Sampuntarat/iStock via Getty Images I have been discussing Cimpress plc ( NASDAQ: CMPR ) in the past, and you can read my previous article published in March 2025. After Q2, the company appears to be leaning on This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Itsanan Sampuntarat/iStock via Getty Images I have been discussing Cimpress plc ( NASDAQ: CMPR ) in the past, and you can read my previous article published in March 2025. After Q2, the company appears to be leaning on This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819534-duluth-holdings-inc-dlth-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "title": "Duluth Holdings Inc. (DLTH) Q2 2025 Earnings Call Transcript",
      "clean_text": "Duluth Holdings Inc. ( NASDAQ: DLTH ) Q2 2025 Earnings Call September 4, 2025 9:30 AM EDT Company Participants Chris Steffes Stephanie Pugliese - President, CEO & Director Heena Agrawal - Interim Chief Accounting Officer, Senior VP & CFO Conference Call Participants Jonathan Komp - Robert W. Baird & Co. Incorporated, Research Division Presentation Operator Good day, and welcome to the Duluth Holdings Inc. Second Quarter 2025 Conference Call. [Operator Instructions] Please note this event is being recorded. I would now like to turn the conference over to Mr. Chris Steffes with Duluth Investor Relations. Please go ahead, sir. Chris Steffes Thank you, and welcome to today's call to discuss Duluth Trading second quarter financial results. Our earnings release, which was issued this morning, is available on our Investor Relations website at ir.duluthtrading.com under News Releases. I'm here today with Stephanie Pugliese, President and Chief Executive Officer; and Heena Agrawal, Senior Vice President and Chief Financial Officer. On today's call, management will provide prepared remarks and then open the call for questions. Before we begin, I would like to remind you that the comments on today's call will include forward-looking statements, which can be identified by the use of words such as estimate, anticipate, expect and similar phrases. Forward-looking statements, by their nature, involve estimates, projections, goals, forecasts and assumptions and are subject to risks and uncertainties that could cause actual results or outcomes to differ materially from those expressed in the forward-looking statements. Such risks and uncertainties include, but are not limited to, those that are described in our most recent annual report on Form 10-K and other SEC filings as applicable. These forward-looking statements speak only as of the date of this conference call and should not be relied upon as predictions of future events. And with that, I will turn",
      "excerpt": "Duluth Holdings Inc. ( NASDAQ: DLTH ) Q2 2025 Earnings Call September 4, 2025 9:30 AM EDT Company Participants Chris Steffes Stephanie Pugliese - President, CEO & Director Heena Agrawal - Interim Chief Accounting Officer, Senior VP & CFO Conference Call Participants Jonathan Komp - Robert W. Baird & Co. Incorporated, Research Division Presentation Operator Good day, and welcome to the Duluth Holdings Inc. Second Quarter 2025 Conference Call. [Operator Instructions] Please note this event is being recorded. I would now like to turn the conference over to Mr. Chris Steffes with Duluth Investor Relations. Please go ahead, sir. Chris Steffes Thank you, and welcome to today's call to discuss Duluth Trading second quarter financial results. Our earnings release, which was issued this morning, is available on our Investor Relations website at ir.duluthtrading.com under News Releases.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819527-shoe-carnival-inc-scvl-q2-2026-earnings-call-transcript?source=feed_all_articles",
      "title": "Shoe Carnival, Inc. (SCVL) Q2 2025 Earnings Call Transcript",
      "clean_text": "Shoe Carnival, Inc. ( NASDAQ: SCVL ) Q2 2025 Earnings Call September 4, 2025 9:00 AM EDT Company Participants Mark Worden - President, CEO & Director Patrick Edwards - Senior VP, CFO, Secretary & Treasurer Tanya Gordon - Executive VP & Chief Merchandising Officer Conference Call Participants Mitchel Kummetz - Seaport Research Partners Samuel Poser - Williams Trading, LLC, Research Division Presentation Operator Good morning, and welcome to Shoe Carnival's Second Quarter 2025 Conference Call. Today's conference call is being recorded and is also being broadcast via webcast. Any reproduction or rebroadcast of any portion of this call is expressly prohibited. Management's remarks today may contain forward-looking statements that involve a number of risk factors. These risk factors could cause the company's actual results to be materially different from those projected in such statements. Forward-looking statements should also be considered in conjunction with the discussion of risk factors included in the company's SEC filings and today's earnings press release. Investors are cautioned not to place undue reliance on these forward-looking statements, which speak only as of today's date. The company disclaims any obligation to update any of the risk factors or to publicly announce any revisions to the forward-looking statements discussed on today's conference call or contained in today's press release to reflect future events or developments. I will now turn the conference over to Mr. Mark Worden, President and CEO of Shoe Carnival, for opening remarks. Mr. Worden, you may begin. Mark Worden President, CEO & Director Good morning, everyone, and thank you for joining us today for Shoe Carnival's Second Quarter 2025 Earnings Conference Call. Joining me on today's call are Patrick Edwards, Chief Financial Officer; and Tanya Gordon, Chief Merchandising Officer. Our second quarter results demonstrate meaningful progress on our corporate strategy. We beat earnings consensus by over 20% and expanded gross margins",
      "excerpt": "Shoe Carnival, Inc. ( NASDAQ: SCVL ) Q2 2025 Earnings Call September 4, 2025 9:00 AM EDT Company Participants Mark Worden - President, CEO & Director Patrick Edwards - Senior VP, CFO, Secretary & Treasurer Tanya Gordon - Executive VP & Chief Merchandising Officer Conference Call Participants Mitchel Kummetz - Seaport Research Partners Samuel Poser - Williams Trading, LLC, Research Division Presentation Operator Good morning, and welcome to Shoe Carnival's Second Quarter 2025 Conference Call. Today's conference call is being recorded and is also being broadcast via webcast. Any reproduction or rebroadcast of any portion of this call is expressly prohibited. Management's remarks today may contain forward-looking statements that involve a number of risk factors. These risk factors could cause the company's actual results to be materially different from those projected in such statements.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819530-salesforce-the-market-hates-the-guidance-i-like-the-value?source=feed_all_articles",
      "title": "Salesforce: The Market Hates The Guidance, I Like The Value (NYSE:CRM)",
      "clean_text": "wdstock/iStock Editorial via Getty Images Salesforce, Inc. (NYSE: NYSE: CRM ) is a tech-focused company that has become a giant in cloud-based software, as pictured by the massive Salesforce tower in San Francisco. The company is known for its complete suite This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "wdstock/iStock Editorial via Getty Images Salesforce, Inc. (NYSE: NYSE: CRM ) is a tech-focused company that has become a giant in cloud-based software, as pictured by the massive Salesforce tower in San Francisco. The company is known for its complete suite This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819528-at-and-t-inc-t-a-and-inc-presents-at-bank-of-america-2025-media-communications-and?source=feed_all_articles",
      "title": "AT&T Inc. (T) A&Inc. Presents at Bank of America 2025 Media, Communications &",
      "clean_text": "AT&T Inc. ( NYSE: T ) A&Inc. Bank of America 2025 Media, Communications & Entertainment Conference September 4, 2025 8:00 AM EDT Company Participants Pascal Desroches - Senior EVP & CFO Conference Call Participants Michael Funk - BofA Securities, Research Division Presentation Michael Funk VP in Equity Research to the Bank of America Media and Telecommunications Conference. Once again, Mike Funk. I head up the telecommunications comm infrastructure and comm software research at the bank. Really very happy to have AT&T and Pascal CFO. He with us this morning to kick off, to kick off day 2. So Pascal, thank you for being here. I did want to point out first and should be up on the screen. I think we had a safe harbor agreement if you all to look at here, pretty standard, but I just wanted to make sure we covered that. first before getting into the Q&A. Pascal, thank you again for coming. Pascal Desroches Senior EVP & CFO My pleasure. Looking forward to our discussion. Question-and-Answer Session Michael Funk BofA Securities, Research Division Absolutely. So wanted to start maybe with current events. So last week, you -- last Tuesday, you announced agreement to acquire EchoStar spectrum, both the 600 and then the mid-band spectrum. You did a call after the announcement. But maybe go back and just give us a little bit of the history to the lead up to the agreement to acquire that spectrum. And then from your seat in the CFO office, the framework that you put around the acquisition and the approach to valuation. Pascal Desroches Senior EVP & CFO Sure thing. Look, if you would ask me at the start of the year, would we have been making a significant spectrum purchase? I probably would have said probably not because the next major auction isn't until likely",
      "excerpt": "AT&T Inc. ( NYSE: T ) A&Inc. Bank of America 2025 Media, Communications & Entertainment Conference September 4, 2025 8:00 AM EDT Company Participants Pascal Desroches - Senior EVP & CFO Conference Call Participants Michael Funk - BofA Securities, Research Division Presentation Michael Funk VP in Equity Research to the Bank of America Media and Telecommunications Conference. Once again, Mike Funk. I head up the telecommunications comm infrastructure and comm software research at the bank. Really very happy to have AT&T and Pascal CFO. He with us this morning to kick off, to kick off day 2. So Pascal, thank you for being here. I did want to point out first and should be up on the screen. I think we had a safe harbor agreement if you all to look at here, pretty standard, but I just wanted to make sure we covered that. first before getting into the Q&A. Pascal, thank you again for coming.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4819451-waterdrop-inc-wdh-q2-2025-earnings-call-prepared-remarks-transcript?source=feed_all_articles",
      "title": "Waterdrop Inc. (WDH) Q2 2025 Earnings Call Transcript",
      "clean_text": "Waterdrop Inc. ( NYSE: WDH ) Q2 2025 Earnings Call September 4, 2025 8:00 AM EDT Company Participants Peng Shen - Co-Founder, Chairman of the Board & CEO Wei Ran - Partner, GM of Insurance Technology Business & Director Jasmine Lee - Corporate Secretary Xiaoying Xu - Head of Finance Presentation Unknown Executive Good morning, everyone. This is [ Tracy Li ] from Waterdrop Investor Relations. It's my pleasure to welcome everyone to Waterdrop's Second Quarter 2025 Earnings Conference Call. [Operator Instructions] As a reminder, today's conference call is being recorded. Please note that discussion today will contain forward-looking statements made under the safe harbor provision of U.S. Private Securities and the Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations. Potential risks and uncertainties include, but not limited to, those outlined in our public filings with the SEC. The company does not undertake any obligation to update any forward-looking statements, except as required under applicable law. Also, this call includes discussion of certain non-GAAP measures. Please refer to our earnings release for a reconciliation between non-GAAP and GAAP. Joining us today on the call are Mr. Shen Peng, our Founder, Chairman and CEO; Mr. Ran Wei, Director and GM of Insurance Business; Mrs. Xu Xiaoying, Head of Finance Department; and Mrs. Jasmine Lee, Corporate Secretary. We'll be happy to take some of the questions in the Mandarin line at the end of the conference call. Peng Shen Co-Founder, Chairman of the Board & CEO Good morning, everyone. This is Shen Peng. In the second quarter, we are pleased to see the integration of AI with the insurance and health care sectors began to deliver satisfying results. Revenue growth accelerated further with quarterly revenue reaching CNY 840 million, up 23.9% year-on-year. Powered by AI, the company has improved",
      "excerpt": "Waterdrop Inc. ( NYSE: WDH ) Q2 2025 Earnings Call September 4, 2025 8:00 AM EDT Company Participants Peng Shen - Co-Founder, Chairman of the Board & CEO Wei Ran - Partner, GM of Insurance Technology Business & Director Jasmine Lee - Corporate Secretary Xiaoying Xu - Head of Finance Presentation Unknown Executive Good morning, everyone. This is [ Tracy Li ] from Waterdrop Investor Relations. It's my pleasure to welcome everyone to Waterdrop's Second Quarter 2025 Earnings Conference Call. [Operator Instructions] As a reminder, today's conference call is being recorded. Please note that discussion today will contain forward-looking statements made under the safe harbor provision of U.S. Private Securities and the Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties that may cause actual results to differ materially from our current expectations.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/coinw-celebrates-8-years-of-commitment-with-15m-users-and-trillions-in-trading-volume-4223653",
      "title": "CoinW Celebrates 8 Years of Commitment with 15M Users and Trillions in Trading Volume By Chainwire",
      "clean_text": "Hong Kong, Hong Kong, SAR, China, September 4th, 2025, Chainwire CoinW celebrates its 8th anniversary, marking an eight-year ascent from a focused upstart to a global crypto platform. Today, it serves more than 15 million registered users and facilitates over $5 billion in 24-hour trading volume. This milestone follows a full-stack platform upgrade that unifies centralized and on-chain rails. It reflects CoinW’s steady, security-first approach to growth. At its core, CoinW always strives to be a trusted gateway to the future of finance. In a recent open letter, founder Gary reaffirmed the vision — “Here for Crypto, Here for the Future.” Guided by this long-term strategy, the company has expanded from simple spot services into a comprehensive trading ecosystem covering derivatives, on-chain products, and professional tools, all designed to empower users with freedom and trust. Within this ecosystem, CoinW has built one of the world’s leading derivatives exchanges — ranked top four globally by CoinGecko — while continuously enhancing products and trading experiences. This year it launched an industry - first Futures Protection Program, a monthly safeguard helping users navigate volatility with greater confidence, transparency, and control. Building the “Future of Trading” Enter its new, full-stack integrated architecture which confidently promises to usher in the “future of trading”. The company has made key optimizations to evolve well-past its initial iteration of diversified trading services. These upgrades provide deeper capability integrations, AI strategy execution and multi-chain interoperability. It unifies previously scattered functions and establishes a solid foundation for implementing key features in the next phase. Beyond Trading CoinW couples product execution with cultural reach to build trust at the community level. This year, the exchange became a regional partner of LALIGA with year-round activations across Asia. It also renewed its official Web3 sponsorship of the EAFF E-1 Football Championship, extending education and engagement on East Asia’s top football stage. The company was recognized as “Most Trustworthy Cryptocurrency Exchange in Asia” at the 7th Hit AI & Blockchain Summit. The award reflects how steadiness and security resonate with mainstream audiences. “Trot On To null ” — 8th Anniversary Theme CoinW celebrates its eighth year with the theme “Trot On To null ,” symbolizing its commitment to moving forward with users while exploring crypto’s limitless possibilities. To mark the occasion, CoinW will connect with its global community through online campaigns and offline meetups, highlighted by a Global 8-City Marathon. More than a celebration, these initiatives embody the “Trot On To null ” spirit — advancing with users into the next chapter of crypto. Looking Ahead True to the “Trot on to null ” spirit, CoinW will keep pushing forward with communities, enhancing products to create more opportunities for everyone. As CoinW celebrates its 8th anniversary, the platform priorities include deepening security, leading in compliance, and scaling a user-centric ecosystem that lets anyone step into crypto — and into the future — with confidence. About CoinW Founded in 2017, CoinW has grown into one of the world’s leading cryptocurrency asset trading platforms, serving a vast and diverse global user base. The platform offers intelligent trading services, with a daily trading volume exceeding $5 billion and a consistent top 4 ranking in CoinMarketCap’s futures markets. With over 15 million registered users, CoinW is deeply committed to advancing wealth creation and blockchain innovation, continually enhancing its product ecosystem with innovations. Since 2022, CoinW has significantly expanded its global brand presence through international sports sponsorships, including a high-profile partnership with football legend Andrea Pirlo. In addition to its commercial growth, CoinW is actively engaged in corporate",
      "excerpt": "Hong Kong, Hong Kong, SAR, China, September 4th, 2025, Chainwire CoinW celebrates its 8th anniversary, marking an eight-year ascent from a focused upstart to a global crypto platform. Today, it serves more than 15 million registered users and facilitates over $5 billion in 24-hour trading volume. This milestone follows a full-stack platform upgrade that unifies centralized and on-chain rails. It reflects CoinW’s steady, security-first approach to growth. At its core, CoinW always strives to be a trusted gateway to the future of finance. In a recent open letter, founder Gary reaffirmed the vision — “Here for Crypto, Here for the Future.” Guided by this long-term strategy, the company has expanded from simple spot services into a comprehensive trading ecosystem covering derivatives, on-chain products, and professional tools, all designed to empower users with freedom and trust.",
      "source": "Investing.com"
    },
    {
      "link": "https://www.investing.com/news/cryptocurrency-news/alphaton-capital-raises-100-million-to-build-ton-digital-asset-treasury-432SI-4222356",
      "title": "AlphaTON Capital raises $100 million to build TON digital asset treasury By Investing.com",
      "clean_text": "AlphaTON Capital Corp, formerly Portage Biotech Inc. (PRTG) , announced plans to acquire approximately $100 million in TON tokens and establish a digital asset treasury focused on Telegram’s blockchain ecosystem. The company will begin trading under the ticker \"ATON\" effective September 4, 2025. The company appointed Brittany Kaiser as Chief Executive Officer and Board Member. Kaiser previously served as a director at Gryphon Digital Mining (GRYP) and was a former executive at Cambridge Analytica. Enzo Villani, founder of Alpha Transform Holdings, will join as Executive Chairman and Chief Investment Officer. AlphaTON Capital entered securities purchase agreements for a private placement of approximately 6.7 million ordinary shares at $5.73 per share, expecting gross proceeds of about $38.2 million before fees. The private placement is scheduled to close around September 5, 2025. The company also secured a loan facility with BitGo Prime, LLC for up to $35 million. The loan will be disbursed at the private placement closing to purchase TON tokens and will be collateralized by TON holdings managed by BitGo or an affiliated entity. Chardan serves as placement agent for the private placement. Multiple law firms provided legal counsel, including Hogan Lovells US LLP for the company and Lucosky Brookman LLP for Chardan. AlphaTON Capital’s strategy includes three components: acquiring TON tokens through volume purchases, implementing yield generation through network validation and staking operations, and developing projects within Telegram’s mini app ecosystem. The company noted that digital asset investments involve risks including market volatility, regulatory uncertainty, and technological challenges. The securities in the private placement have not been registered under the Securities Act of 1933 and may not be resold except under specific exemptions or registration.",
      "excerpt": "AlphaTON Capital Corp, formerly Portage Biotech Inc. (PRTG) , announced plans to acquire approximately $100 million in TON tokens and establish a digital asset treasury focused on Telegram’s blockchain ecosystem. The company will begin trading under the ticker \"ATON\" effective September 4, 2025. The company appointed Brittany Kaiser as Chief Executive Officer and Board Member. Kaiser previously served as a director at Gryphon Digital Mining (GRYP) and was a former executive at Cambridge Analytica. Enzo Villani, founder of Alpha Transform Holdings, will join as Executive Chairman and Chief Investment Officer. AlphaTON Capital entered securities purchase agreements for a private placement of approximately 6.7 million ordinary shares at $5.73 per share, expecting gross proceeds of about $38.2 million before fees. The private placement is scheduled to close around September 5, 2025.",
      "source": "Investing.com"
    }
  ],
  "total_articles": 18,
  "cleaned_at": "2025-09-07T10:52:46.208404"
}