{
  "date": "20250831",
  "data_type": "articles_clean",
  "saved_at": "2025-09-07T10:52:46.191005",
  "articles": [
    {
      "link": "https://www.bbc.com/news/articles/cp890n51684o?at_medium=RSS&at_campaign=rss",
      "title": "Tories pledge to get 'all our oil and gas out of the North Sea'",
      "clean_text": "Kemi Badenoch has said her party will remove all net zero requirements on oil and gas companies drilling in the North Sea if elected. The Conservative leader is to formally announce the plan to focus solely on \"maximising extraction\" to get \"all our oil and gas out of the North Sea\" in a speech in Aberdeen on Tuesday, She will claim that net zero measures mean households end up \"paying the price through higher energy bills\". The Labour government has committed to banning new exploration licences. A spokesperson said: \"We'll take no lectures from Kemi Badenoch. Every family and business paid the price of the Conservatives' failure to secure the UK's energy.\" Exploring new fields would \"not take a penny off bills\" or improve energy security and would \"only accelerate the worsening climate crisis\", a government spokesperson warned. Badenoch signalled a significant change in Conservative climate policy when she announced earlier this year that reaching net zero would be \"impossible\" by 2050 . Successive UK governments have pledged to reach the target by 2050 and it was written into law by Theresa May in 2019. It means the UK must cut carbon emissions until it removes as much as it produces, in line with the 2015 Paris Climate Agreement. Now Badenoch has said that requirements to work towards net zero are a burden on oil and gas producers in the North Sea which are damaging the economy and which she would remove. The Tory leader said a Conservative government would scrap the need to reduce emissions or to work on technologies such as carbon storage. Badenoch said it was \"absurd\" the UK was leaving \"vital resources untapped\" while \"neighbours like Norway extracted them from the same sea bed\". Her plan echoes US President Donald Trump's pledge to \"drill, baby, drill\" and embark on new oil and gas exploration. It is a reversal of former President Joe Biden's Inflation Reduction Act, which channelled billions of dollars into clean energy. In 2023, then Prime Minister Rishi Sunak granted 100 new licences to drill in the North Sea which he said at the time was \"entirely consistent\" with net zero commitments. Since then, major energy companies such as BP have U-turned on the level of investment in renewables to focus on increasing oil and gas production in order to boost profitability. Tessa Khan, executive director of Uplift, a research and campaign group, said Badenoch's plan was \"reckless\" and would not \"bring down energy bills\". \"These rules are the bare minimum to needed hold the industry to account, and removing them will simply mean more emissions, more environmental harm and more handouts to oil and gas giants at the nation's expense,\" she said. Reform UK has said it will abolish the push for net zero if elected. But Liberal Democrat environment spokesperson Tim Farron said scrapping requirements to reduce emissions \"is nothing short of irresponsible environmental vandalism\". He said the UK \"should be setting our sights on leading the world in clean energy, in off shore wind, instead of falling back to a dependency on fossil fuels\". Research shows that 2024 was the first calendar year where the average temperature exceeded 1.5°C. This made it the hottest year since records began in 1850, according to the Copernicus Climate Change Service, which is managed by the European Commission and uses data from the European Union's space programme. The UK was one of 200 countries to sign the Paris Agreement who agreed to \"pursue efforts\" to limit global temperature rises to 1.5C and keep them \"well below\" 2.0C above those recorded in pre-industrial times. Gillian Martin, the Scottish government's energy secretary, said: \"Too many are offering easy answers when what we need are the right answers.\" She said that because the North Sea basin is \"maturing\", the \"responsible approach is to plan now for this eventuality, transitioning to new fuels and sustainable energy in a way that protects our energy security and Scotland's highly skilled",
      "excerpt": "Kemi Badenoch has said her party will remove all net zero requirements on oil and gas companies drilling in the North Sea if elected. The Conservative leader is to formally announce the plan to focus solely on \"maximising extraction\" to get \"all our oil and gas out of the North Sea\" in a speech in Aberdeen on Tuesday, She will claim that net zero measures mean households end up \"paying the price through higher energy bills\". The Labour government has committed to banning new exploration licences. A spokesperson said: \"We'll take no lectures from Kemi Badenoch. Every family and business paid the price of the Conservatives' failure to secure the UK's energy.\" Exploring new fields would \"not take a penny off bills\" or improve energy security and would \"only accelerate the worsening climate crisis\", a government spokesperson warned.",
      "source": "feeds.bbci"
    },
    {
      "link": "https://seekingalpha.com/article/4818157-broadcom-earnings-preview-premium-valuation-premium-risks-rating-upgrade?source=feed_all_articles",
      "title": "Broadcom Earnings Preview: Premium Valuation, Premium Risks (Rating Upgrade) (NASDAQ:AVGO)",
      "clean_text": "Getty Images When I last covered Broadcom Inc. ( AVGO ) on January 6th, 2025 with my article â\u0080\u009cBroadcom: Vulnerable To Bearish Reversals,â\u0080\u009d the stock was trading near long-term highs following a significant rally that saw a near-doubling in share This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of AVGO, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Getty Images When I last covered Broadcom Inc. ( AVGO ) on January 6th, 2025 with my article â\u0080\u009cBroadcom: Vulnerable To Bearish Reversals,â\u0080\u009d the stock was trading near long-term highs following a significant rally that saw a near-doubling in share This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial long position in the shares of AVGO, NVDA either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818166-inflation-stable-now?source=feed_all_articles",
      "title": "Inflation: Stable Now",
      "clean_text": "grdenis/iStock via Getty Images The July numbers are out. All-in-all, the numbers are pretty good. Economic growth remains modest, but above 2.0 percent. Unemployment remains constant at around 4.2 percent. And, now we hear that, year-over-year, the rate of inflation, using the preferred This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "grdenis/iStock via Getty Images The July numbers are out. All-in-all, the numbers are pretty good. Economic growth remains modest, but above 2.0 percent. Unemployment remains constant at around 4.2 percent. And, now we hear that, year-over-year, the rate of inflation, using the preferred This article was written by Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818123-flawed-jobs-data-threatens-fed-september-rate-cut?source=feed_all_articles",
      "title": "Flawed Jobs Data Threatens Fedâ\u0080\u0099s September Rate Cut",
      "clean_text": "Andrew Harnik/Getty Images News The tension in the market is building, and this week's economic data is likely to decide whether the Fed cuts rates at its September FOMC meeting. The market is currently assigning a roughly 85% chance of a September Enjoying this article? Youâ\u0080\u0099ll find my investing group a valuable tool for your research. Reading The Markets delivers daily, institutional-style updates with written commentary, videos, transcripts, and glossaries. The focus is on finding balance and alpha across asset classes. If you value advanced, independent market analysis and want deeper insight into macro drivers of equities, rates, credit, and commodities, join us . This article was written by Michael Kramer is the founder of Mott Capital, and is a long-only investor who focuses on macro themes and studies trends and options activities to identify and assess entry and exit points for investments in his long-term focused thematic growth strategy. He is a former buy-side trader, analyst, and portfolio manager with 30 years of experience tracking market technicals, fundamentals, and options. Michael Kramer leads the investing group Reading the Markets, where he helps a devoted following of members to better understand what is driving trading and where the market is likely heading, both the short and long-term. Features of the investing group include: daily written commentary and videos analyzing the driving factors behind price action; general macro trend education to help members make well-informed decisions based on market conditions, interest rates, currency movements and how they all interact; chat for questions and community dialogue; and regular Zoom videos sessions to discuss current ideas and answer questions. The level of access RTM subscribers and the expertise of the source are unprecedented given that the subscription price is a fraction of similar technical coaching and mentoring services. Learn more. Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. This report contains independent commentary to be used for informational and educational purposes only. Michael Kramer is a member and investment adviser representative with Mott Capital Management. Mr. Kramer is not affiliated with this company and does not serve on the board of any related company that issued this stock. All opinions and analyses presented by Michael Kramer in this analysis or market report are solely Michael Kramerâ\u0080\u0099s views. Readers should not treat any opinion, viewpoint, or prediction expressed by Michael Kramer as a specific solicitation or recommendation to buy or sell a particular security or follow a particular strategy. Michael Kramerâ\u0080\u0099s analyses are based upon information and independent research that he considers reliable, but neither Michael Kramer nor Mott Capital Management guarantees its completeness or accuracy, and it should not be relied upon as such. Michael Kramer is not under any obligation to update or correct any information presented in his analyses. Mr. Kramerâ\u0080\u0099s statements, guidance, and opinions are subject to change without notice. Past performance is not indicative of future results. Neither Michael Kramer nor Mott Capital Management guarantees any specific outcome or profit. You should be aware of the real risk of loss in following any strategy or investment commentary presented in this analysis. Strategies or investments discussed may fluctuate in price or value. Investments or strategies mentioned in this analysis may not be suitable for you. This material does not consider your particular investment objectives, financial situation, or needs and is not",
      "excerpt": "Andrew Harnik/Getty Images News The tension in the market is building, and this week's economic data is likely to decide whether the Fed cuts rates at its September FOMC meeting. The market is currently assigning a roughly 85% chance of a September Enjoying this article? Youâ\u0080\u0099ll find my investing group a valuable tool for your research. Reading The Markets delivers daily, institutional-style updates with written commentary, videos, transcripts, and glossaries. The focus is on finding balance and alpha across asset classes. If you value advanced, independent market analysis and want deeper insight into macro drivers of equities, rates, credit, and commodities, join us .",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://seekingalpha.com/article/4818162-august-job-report-preview-weak-report-to-cement-september-fed-cut?source=feed_all_articles",
      "title": "August Job Report Preview: Weak Report To Cement The September Fed Cut",
      "clean_text": "Chip Somodevilla/Getty Images News The US Bureau of Labor Statistics is set to release the August labor market report on Friday, September 5th. The consensus market expectations are: This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial short position in the shares of SPX either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "Chip Somodevilla/Getty Images News The US Bureau of Labor Statistics is set to release the August labor market report on Friday, September 5th. The consensus market expectations are: This article was written by Analystâ\u0080\u0099s Disclosure: I/we have a beneficial short position in the shares of SPX either through stock ownership, options, or other derivatives. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.bbc.com/news/articles/c0mlen3grx7o?at_medium=RSS&at_campaign=rss",
      "title": "SCO: China and India attempt to repair strained ties",
      "clean_text": "India's Prime Minister Narendra Modi landed in China on Sunday with the sting of Donald Trump's US tariffs still at the top of his mind. Since Wednesday, tariffs on Indian goods imported into the US, like diamonds and prawns, now stand at 50% – which the US president says is punishment for Delhi's continued purchase of Russian oil. Experts say the levies threaten to leave lasting bruises on India's vibrant export sector, and its ambitious growth targets. China's President Xi Jinping, too, is trying to revive a sluggish economy at a time when sky-high US tariffs threaten to derail his plans. Against this backdrop, the leaders of the world's two most populous countries may both be looking for a reset in their relationship, which has previously been marked by mistrust, in large part due to border disputes. \"Put simply, what happens in this relationship matters to the rest of the world,\" Chietigj Bajpaee and Yu Jie of Chatham House wrote in a recent editorial. \"India was never going to be the bulwark against China that the West (and the United States in particular) thought it was... Modi's China visit marks a potential turning point.\" India and China are economic powerhouses – the world's fifth- and second-largest, respectively. But with India's growth expected to remain above 6% in the coming years, a $4tn (£3tn) economy and $5tn stock market, it is on the way to becoming the third-largest by 2028, according to the International Monetary Fund (IMF). \"While the world has traditionally focused on the single most important bilateral relationship in the world, US and China, it is time we shift more focus on how the second and would-be third largest economies, China and India, can work together,\" says Qian Liu, founder and chief executive of Wusawa Advisory, based in Beijing. But the relationship is deeply challenging. The two sides have an unresolved and long-standing territorial dispute that signifies a much broader and deeper rivalry. Violence erupted across Ladakh's Galwan Valley in June 2020 – the worst period of hostility between the two countries in more than four decades. The fallout was largely economic – a return of direct flights was taken off the table, visas and Chinese investments were put on hold leading to slower infrastructure projects, and India banned more than 200 Chinese apps, including TikTok. \"Dialogue will be needed to help better manage the expectations of other powers who look to India-China as a key factor of Asia's wider stability,\" says Antoine Levesques, senior fellow for South and Central Asian defence, strategy and diplomacy at the International Institute for Strategic Studies. There are other fault lines too, including Tibet, the Dalai Lama, and water disputes over China's plans to build the world's largest hydroelectric power project across a river shared by both nations, as well as tensions with Pakistan after the Pahalgam attack. India also does not currently enjoy good relations with most of its neighbours in South Asia, whereas China is a key trading partner for Pakistan, Bangladesh, Sri Lanka and Afghanistan. \"I would be surprised if a BYD factory is coming to India, but there may be some soft wins,\" says Priyanka Kishore, founder and principal economist at research company Asia Decoded. It's already been announced that direct flights will resume, there may be more relaxations on visas, and other economic deals. However, the relationship between Delhi and Beijing is \"an uncomfortable alliance to be sure\", notes Ms Kishore. \"Remember at one point, the US and India were coming together to balance China,\" she adds. But India is completely perplexed with the US and its position: \"So it's a smart move – and feeds into the multipolar narrative that both India and China believe in.\" Modi is travelling to China for the Shanghai Co-operation Organisation (SCO) - a regional body aimed at projecting an alternative worldview to that of the West. Members include China, India, Iran, Pakistan and Russia. In",
      "excerpt": "India's Prime Minister Narendra Modi landed in China on Sunday with the sting of Donald Trump's US tariffs still at the top of his mind. Since Wednesday, tariffs on Indian goods imported into the US, like diamonds and prawns, now stand at 50% – which the US president says is punishment for Delhi's continued purchase of Russian oil. Experts say the levies threaten to leave lasting bruises on India's vibrant export sector, and its ambitious growth targets. China's President Xi Jinping, too, is trying to revive a sluggish economy at a time when sky-high US tariffs threaten to derail his plans. Against this backdrop, the leaders of the world's two most populous countries may both be looking for a reset in their relationship, which has previously been marked by mistrust, in large part due to border disputes.",
      "source": "feeds.bbci"
    },
    {
      "link": "https://seekingalpha.com/article/4818146-market-efficiency-is-impossible-here-is-why-and-why-it-matters?source=feed_all_articles",
      "title": "Market Efficiency Is Impossible: Here Is Why & Why It Matters",
      "clean_text": "DariaRen/iStock via Getty Images In our last article entitled, \" Intrinsic Value is Subjective ,\" we presented decisive empirical evidence that directly falsified the Efficient Market Hypothesis (EMH). We showed that even under conditions where If you are really serious about improving your performance as an investor -- during this historic moment, which is providing once-in-a-decade opportunities -- I highly recommend that you subscribe to Successful Portfolio Strategy . This service is designed to empower you to become a successful strategic manager of your investments. Few times in history has it been as important as it is now to have a winning portfolio strategy. So, right now is truly the time to take decisive action. This article was written by James A. Kostohryz has 20+ years of experience as a global investment professional. He has worked as an analyst at one of the world's largest asset management firms covering emerging markets, banking, energy, construction, real estate, metals and mining. He has also served as Global Portfolio Strategist and Head of International Investments for an investment bank. He is currently managing Investor Acumen, a firm specializing in global portfolio strategy, macro forecasting, and quant analytics. James is the leader of the investing group Successful Portfolio Strategy , a service designed to empower investors to achieve investment performance through implementation of a portfolio strategy system. Features include: 2 model portfolios, tactical asset allocation and mentorship for execution, analysis via video and articles, and more. Learn More . James also contributes to the group account Investor Acumen on Seeking Alpha. Analystâ\u0080\u0099s Disclosure: I/we have no stock, option or similar derivative position in any of the companies mentioned, and no plans to initiate any such positions within the next 72 hours. I wrote this article myself, and it expresses my own opinions. I am not receiving compensation for it (other than from Seeking Alpha). I have no business relationship with any company whose stock is mentioned in this article. All positions disclosed to members of Successful Portfolio Strategy. Seeking Alpha's Disclosure: Past performance is no guarantee of future results. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. Any views or opinions expressed above may not reflect those of Seeking Alpha as a whole. Seeking Alpha is not a licensed securities dealer, broker or US investment adviser or investment bank. Our analysts are third party authors that include both professional investors and individual investors who may not be licensed or certified by any institute or regulatory body.",
      "excerpt": "DariaRen/iStock via Getty Images In our last article entitled, \" Intrinsic Value is Subjective ,\" we presented decisive empirical evidence that directly falsified the Efficient Market Hypothesis (EMH). We showed that even under conditions where If you are really serious about improving your performance as an investor -- during this historic moment, which is providing once-in-a-decade opportunities -- I highly recommend that you subscribe to Successful Portfolio Strategy . This service is designed to empower you to become a successful strategic manager of your investments. Few times in history has it been as important as it is now to have a winning portfolio strategy. So, right now is truly the time to take decisive action. This article was written by James A. Kostohryz has 20+ years of experience as a global investment professional.",
      "source": "Seeking Alpha"
    },
    {
      "link": "https://www.bbc.com/news/articles/ce83r56xwj7o?at_medium=RSS&at_campaign=rss",
      "title": "The trade in US body parts that's completely legal - but ripe for exploitation",
      "clean_text": "Harold Dillard was 56 when he was diagnosed with an aggressive cancer around his abdomen in November 2009. Within weeks the former car mechanic and handyman - a Texan \"Mr Fix It\" type who wore a cowboy hat and jeans nearly every day - was in end-of-life hospice care. In his final days, Mr Dillard was visited at the hospice by a company called Bio Care. They asked if he might like to donate his body to medical science, where it could be used by doctors to practise knee replacement surgery. The company would cremate the parts of his body that weren't used and return his ashes free of charge. \"His eyes lit up,\" his daughter, Farrah Fasold, remembers. \"He viewed that as lessening the burden on his family. Donating his body was the last selfless thing he could do.\" Mr Dillard died on Christmas Eve, and within hours, a car from Bio Care pulled up outside the hospice and drove his body away. A few months later, his daughter received a call from the police. They had found her father's head. At the company's warehouse, police say they found more than 100 body parts belonging to 45 people. \"All of the bodies appeared to have been dismembered by a coarse cutting instrument, such as a chainsaw,\" a detective wrote at the time. Ms Fasold says she imagined her father's body would be handled with respect - but instead it was \"mutilated\", she believes. \"I would close my eyes at night and see huge red tubs filled with body parts. I had insomnia. I wasn't sleeping.\" The company said at the time through a lawyer that they denied mistreating bodies. The firm no longer exists, and its former owners could not be reached for comment. This was Ms Fasold's first introduction to the world of so-called body brokers: private companies that acquire corpses, dissect them, and then sell the limbs for a profit, often to medical research centres. For critics, the industry represents a modern form of grave-robbing. Others argue that body-donation is essential for medical research and that private companies are simply filling a gap left by universities, who consistently fail to acquire enough dead bodies to support their education and research programmes. Although Ms Fasold didn't realise it at the time, her father's case sheds light on an emotion-fuelled debate that cuts to the centre of our ideas about life, and what it means to have a dignified death. Since at least the 19th Century, when the teaching of medicine expanded, some scientifically-minded people have rather liked the idea that their corpse could be used to train doctors. Brandi Schmitt is director of the anatomical donation programme at the University of California, a popular destination for people wishing to bequeath their bodies. She says last year they received 1,600 \"whole-body donations\", and they have a list of almost 50,000 living people who have already registered to do so. Often, body-donation is driven by simple altruism, she says: \"A lot of people are either educated or interested in education.\" But financial factors come into play too. Funerals are expensive, Ms Schmitt says; many are tempted by the prospect of their body being taken away for free. The Body Shop Conversations with body brokers, scientists and affected families shed light on this murky industry. Listen on BBC Sounds or on BBC Radio 4 at 13:30 BST on Sunday 31 August. Produced by Jacob Dabb and 2 Degrees West. Like most medical schools, the University of California does not profit from its body-donation programme, and it has strict guidelines for how corpses - or cadavers, as they are known medically - should be handled. But in recent decades, something more controversial has emerged in the US: a network of for-profit businesses that act as middlemen, acquiring bodies from individuals, dissecting them, and then selling them on. They are widely nicknamed body brokers, though the firms call themselves \"non-transplant tissue banks\". Some of their customers are universities, which use cadavers to train doctors. Others are",
      "excerpt": "Harold Dillard was 56 when he was diagnosed with an aggressive cancer around his abdomen in November 2009. Within weeks the former car mechanic and handyman - a Texan \"Mr Fix It\" type who wore a cowboy hat and jeans nearly every day - was in end-of-life hospice care. In his final days, Mr Dillard was visited at the hospice by a company called Bio Care. They asked if he might like to donate his body to medical science, where it could be used by doctors to practise knee replacement surgery. The company would cremate the parts of his body that weren't used and return his ashes free of charge. \"His eyes lit up,\" his daughter, Farrah Fasold, remembers. \"He viewed that as lessening the burden on his family. Donating his body was the last selfless thing he could do.\" Mr Dillard died on Christmas Eve, and within hours, a car from Bio Care pulled up outside the hospice and drove his body away.",
      "source": "feeds.bbci"
    }
  ],
  "total_articles": 8,
  "cleaned_at": "2025-09-07T10:52:46.191000"
}